LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#ifndef __AW_PID_2113_REG_H__
#define __AW_PID_2113_REG_H__

/* registers list */
#define AW_PID_2113_ID_REG		(0x00)
#define AW_PID_2113_SYSST_REG		(0x01)
#define AW_PID_2113_SYSINT_REG		(0x02)
#define AW_PID_2113_SYSINTM_REG		(0x03)
#define AW_PID_2113_SYSCTRL_REG		(0x04)
#define AW_PID_2113_SYSCTRL2_REG	(0x05)
#define AW_PID_2113_I2SCTRL1_REG	(0x06)
#define AW_PID_2113_I2SCTRL2_REG	(0x07)
#define AW_PID_2113_I2SCTRL3_REG	(0x08)
#define AW_PID_2113_DACCFG1_REG		(0x09)
#define AW_PID_2113_DACCFG2_REG		(0x0A)
#define AW_PID_2113_DACCFG3_REG		(0x0B)
#define AW_PID_2113_DACCFG4_REG		(0x0C)
#define AW_PID_2113_DACCFG5_REG		(0x0D)
#define AW_PID_2113_DACCFG6_REG		(0x0E)
#define AW_PID_2113_DACCFG7_REG		(0x0F)
#define AW_PID_2113_DACCFG8_REG		(0x10)
#define AW_PID_2113_PWMCTRL1_REG	(0x11)
#define AW_PID_2113_PWMCTRL2_REG	(0x12)
#define AW_PID_2113_I2SCFG1_REG		(0x13)
#define AW_PID_2113_DBGCTRL_REG		(0x14)
#define AW_PID_2113_DACCFG9_REG		(0x15)
#define AW_PID_2113_DACCFG10_REG	(0x16)
#define AW_PID_2113_DACST_REG		(0x20)
#define AW_PID_2113_VBAT_REG		(0x21)
#define AW_PID_2113_TEMP_REG		(0x22)
#define AW_PID_2113_PVDD_REG		(0x23)
#define AW_PID_2113_ISNDAT_REG		(0x24)
#define AW_PID_2113_VSNDAT_REG		(0x25)
#define AW_PID_2113_I2SINT_REG		(0x26)
#define AW_PID_2113_I2SCAPCNT_REG	(0x27)
#define AW_PID_2113_ANASTA1_REG		(0x28)
#define AW_PID_2113_ANASTA2_REG		(0x29)
#define AW_PID_2113_ANASTA3_REG		(0x2A)
#define AW_PID_2113_TESTDET_REG		(0x2B)
#define AW_PID_2113_DSMCFG1_REG		(0x30)
#define AW_PID_2113_DSMCFG2_REG		(0x31)
#define AW_PID_2113_DSMCFG3_REG		(0x32)
#define AW_PID_2113_DSMCFG4_REG		(0x33)
#define AW_PID_2113_DSMCFG5_REG		(0x34)
#define AW_PID_2113_DSMCFG6_REG		(0x35)
#define AW_PID_2113_DSMCFG7_REG		(0x36)
#define AW_PID_2113_DSMCFG8_REG		(0x37)
#define AW_PID_2113_TESTIN_REG		(0x38)
#define AW_PID_2113_TESTOUT_REG		(0x39)
#define AW_PID_2113_SADCCTRL1_REG	(0x3A)
#define AW_PID_2113_SADCCTRL2_REG	(0x3B)
#define AW_PID_2113_SADCCTRL3_REG	(0x3C)
#define AW_PID_2113_SADCCTRL4_REG	(0x3D)
#define AW_PID_2113_SADCCTRL5_REG	(0x3E)
#define AW_PID_2113_SADCCTRL6_REG	(0x3F)
#define AW_PID_2113_SADCCTRL7_REG	(0x40)
#define AW_PID_2113_VSNTM1_REG		(0x50)
#define AW_PID_2113_VSNTM2_REG		(0x51)
#define AW_PID_2113_ISNCTRL1_REG	(0x52)
#define AW_PID_2113_ISNCTRL2_REG	(0x53)
#define AW_PID_2113_PLLCTRL1_REG	(0x54)
#define AW_PID_2113_PLLCTRL2_REG	(0x55)
#define AW_PID_2113_PLLCTRL3_REG	(0x56)
#define AW_PID_2113_CDACTRL1_REG	(0x57)
#define AW_PID_2113_CDACTRL2_REG	(0x58)
#define AW_PID_2113_DITHERCFG1_REG	(0x59)
#define AW_PID_2113_DITHERCFG2_REG	(0x5A)
#define AW_PID_2113_DITHERCFG3_REG	(0x5B)
#define AW_PID_2113_CPCTRL_REG		(0x5C)
#define AW_PID_2113_BSTCTRL1_REG	(0x60)
#define AW_PID_2113_BSTCTRL2_REG	(0x61)
#define AW_PID_2113_BSTCTRL3_REG	(0x62)
#define AW_PID_2113_BSTCTRL4_REG	(0x63)
#define AW_PID_2113_BSTCTRL5_REG	(0x64)
#define AW_PID_2113_BSTCTRL6_REG	(0x65)
#define AW_PID_2113_BSTCTRL7_REG	(0x66)
#define AW_PID_2113_BSTCTRL8_REG	(0x67)
#define AW_PID_2113_BSTCTRL9_REG	(0x68)
#define AW_PID_2113_TM_REG		(0x6F)
#define AW_PID_2113_TESTCTRL1_REG	(0x70)
#define AW_PID_2113_TESTCTRL2_REG	(0x71)
#define AW_PID_2113_EFCTRL1_REG		(0x72)
#define AW_PID_2113_EFCTRL2_REG		(0x73)
#define AW_PID_2113_EFWH_REG		(0x74)
#define AW_PID_2113_EFWM2_REG		(0x75)
#define AW_PID_2113_EFWM1_REG		(0x76)
#define AW_PID_2113_EFWL_REG		(0x77)
#define AW_PID_2113_EFRH4_REG		(0x78)
#define AW_PID_2113_EFRH3_REG		(0x79)
#define AW_PID_2113_EFRH2_REG		(0x7A)
#define AW_PID_2113_EFRH1_REG		(0x7B)
#define AW_PID_2113_EFRL4_REG		(0x7C)
#define AW_PID_2113_EFRL3_REG		(0x7D)
#define AW_PID_2113_EFRL2_REG		(0x7E)
#define AW_PID_2113_EFRL1_REG		(0x7F)

/********************************************
 * Register Access
 *******************************************/
#define AW_PID_2113_REG_MAX	(0x80)

#define AW_PID_2113_REG_NONE_ACCESS					(0)
#define AW_PID_2113_REG_RD_ACCESS					(1 << 0)
#define AW_PID_2113_REG_WR_ACCESS					(1 << 1)

const unsigned char aw_pid_2113_reg_access[AW_PID_2113_REG_MAX] = {
	[AW_PID_2113_ID_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_SYSST_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_SYSINT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_SYSINTM_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SYSCTRL_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SYSCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_I2SCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_I2SCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_I2SCTRL3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG4_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG5_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG6_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG7_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG8_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_PWMCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_PWMCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_I2SCFG1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DBGCTRL_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG9_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACCFG10_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DACST_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_VBAT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_TEMP_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_PVDD_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_ISNDAT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_VSNDAT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_I2SINT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_I2SCAPCNT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_ANASTA1_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_ANASTA2_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_ANASTA3_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_TESTDET_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_DSMCFG1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG4_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG5_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG6_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG7_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DSMCFG8_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_TESTIN_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_TESTOUT_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_SADCCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SADCCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SADCCTRL3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SADCCTRL4_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SADCCTRL5_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SADCCTRL6_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_SADCCTRL7_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_VSNTM1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_VSNTM2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_ISNCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_ISNCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_PLLCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_PLLCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_PLLCTRL3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_CDACTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_CDACTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DITHERCFG1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DITHERCFG2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_DITHERCFG3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_CPCTRL_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL3_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL4_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL5_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL6_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL7_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL8_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_BSTCTRL9_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_TM_REG]	= (AW_PID_2113_REG_NONE_ACCESS),
	[AW_PID_2113_TESTCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_TESTCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFCTRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFCTRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFWH_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFWM2_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFWM1_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFWL_REG]	= (AW_PID_2113_REG_RD_ACCESS | AW_PID_2113_REG_WR_ACCESS),
	[AW_PID_2113_EFRH4_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRH3_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRH2_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRH1_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRL4_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRL3_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRL2_REG]	= (AW_PID_2113_REG_RD_ACCESS),
	[AW_PID_2113_EFRL1_REG]	= (AW_PID_2113_REG_RD_ACCESS),
};

/* detail information of registers begin */
/* ID (0x00) detail */
/* IDCODE bit 15:0 (ID 0x00) */
#define AW_PID_2113_IDCODE_START_BIT	(0)
#define AW_PID_2113_IDCODE_BITS_LEN	(16)
#define AW_PID_2113_IDCODE_MASK	\
	(~(((1<<AW_PID_2113_IDCODE_BITS_LEN)-1) << AW_PID_2113_IDCODE_START_BIT))

#define AW_PID_2113_IDCODE_DEFAULT_VALUE	(0x2113)
#define AW_PID_2113_IDCODE_DEFAULT	\
	(AW_PID_2113_IDCODE_DEFAULT_VALUE << AW_PID_2113_IDCODE_START_BIT)

/* default value of ID (0x00) */
/* #define AW_PID_2113_ID_DEFAULT		(0x2113) */

/* SYSST (0x01) detail */
/* OVP2S bit 15 (SYSST 0x01) */
#define AW_PID_2113_OVP2S_START_BIT	(15)
#define AW_PID_2113_OVP2S_BITS_LEN	(1)
#define AW_PID_2113_OVP2S_MASK	\
	(~(((1<<AW_PID_2113_OVP2S_BITS_LEN)-1) << AW_PID_2113_OVP2S_START_BIT))

