LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_OVP2S_NORMAL	(0)
#define AW_PID_2113_OVP2S_NORMAL_VALUE	\
	(AW_PID_2113_OVP2S_NORMAL << AW_PID_2113_OVP2S_START_BIT)

#define AW_PID_2113_OVP2S_OVP	(1)
#define AW_PID_2113_OVP2S_OVP_VALUE	\
	(AW_PID_2113_OVP2S_OVP << AW_PID_2113_OVP2S_START_BIT)

#define AW_PID_2113_OVP2S_DEFAULT_VALUE	(0)
#define AW_PID_2113_OVP2S_DEFAULT	\
	(AW_PID_2113_OVP2S_DEFAULT_VALUE << AW_PID_2113_OVP2S_START_BIT)

/* UVLS bit 14 (SYSST 0x01) */
#define AW_PID_2113_UVLS_START_BIT	(14)
#define AW_PID_2113_UVLS_BITS_LEN	(1)
#define AW_PID_2113_UVLS_MASK	\
	(~(((1<<AW_PID_2113_UVLS_BITS_LEN)-1) << AW_PID_2113_UVLS_START_BIT))

#define AW_PID_2113_UVLS_NORMAL	(0)
#define AW_PID_2113_UVLS_NORMAL_VALUE	\
	(AW_PID_2113_UVLS_NORMAL << AW_PID_2113_UVLS_START_BIT)

#define AW_PID_2113_UVLS_UVLO	(1)
#define AW_PID_2113_UVLS_UVLO_VALUE	\
	(AW_PID_2113_UVLS_UVLO << AW_PID_2113_UVLS_START_BIT)

#define AW_PID_2113_UVLS_DEFAULT_VALUE	(0)
#define AW_PID_2113_UVLS_DEFAULT	\
	(AW_PID_2113_UVLS_DEFAULT_VALUE << AW_PID_2113_UVLS_START_BIT)

/* ADPS bit 13 (SYSST 0x01) */
#define AW_PID_2113_ADPS_START_BIT	(13)
#define AW_PID_2113_ADPS_BITS_LEN	(1)
#define AW_PID_2113_ADPS_MASK	\
	(~(((1<<AW_PID_2113_ADPS_BITS_LEN)-1) << AW_PID_2113_ADPS_START_BIT))

#define AW_PID_2113_ADPS_TRANSPARENT	(0)
#define AW_PID_2113_ADPS_TRANSPARENT_VALUE	\
	(AW_PID_2113_ADPS_TRANSPARENT << AW_PID_2113_ADPS_START_BIT)

#define AW_PID_2113_ADPS_BOOST	(1)
#define AW_PID_2113_ADPS_BOOST_VALUE	\
	(AW_PID_2113_ADPS_BOOST << AW_PID_2113_ADPS_START_BIT)

#define AW_PID_2113_ADPS_DEFAULT_VALUE	(0)
#define AW_PID_2113_ADPS_DEFAULT	\
	(AW_PID_2113_ADPS_DEFAULT_VALUE << AW_PID_2113_ADPS_START_BIT)

/* DSPS bit 12 (SYSST 0x01) */
#define AW_PID_2113_DSPS_START_BIT	(12)
#define AW_PID_2113_DSPS_BITS_LEN	(1)
#define AW_PID_2113_DSPS_MASK	\
	(~(((1<<AW_PID_2113_DSPS_BITS_LEN)-1) << AW_PID_2113_DSPS_START_BIT))

#define AW_PID_2113_DSPS_NORMAL	(0)
#define AW_PID_2113_DSPS_NORMAL_VALUE	\
	(AW_PID_2113_DSPS_NORMAL << AW_PID_2113_DSPS_START_BIT)

#define AW_PID_2113_DSPS_DSP_STABLE	(1)
#define AW_PID_2113_DSPS_DSP_STABLE_VALUE	\
	(AW_PID_2113_DSPS_DSP_STABLE << AW_PID_2113_DSPS_START_BIT)

#define AW_PID_2113_DSPS_DEFAULT_VALUE	(0)
#define AW_PID_2113_DSPS_DEFAULT	\
	(AW_PID_2113_DSPS_DEFAULT_VALUE << AW_PID_2113_DSPS_START_BIT)

/* BSTOCS bit 11 (SYSST 0x01) */
#define AW_PID_2113_BSTOCS_START_BIT	(11)
#define AW_PID_2113_BSTOCS_BITS_LEN	(1)
#define AW_PID_2113_BSTOCS_MASK	\
	(~(((1<<AW_PID_2113_BSTOCS_BITS_LEN)-1) << AW_PID_2113_BSTOCS_START_BIT))

#define AW_PID_2113_BSTOCS_NORMAL	(0)
#define AW_PID_2113_BSTOCS_NORMAL_VALUE	\
	(AW_PID_2113_BSTOCS_NORMAL << AW_PID_2113_BSTOCS_START_BIT)

#define AW_PID_2113_BSTOCS_OVER_CURRENT	(1)
#define AW_PID_2113_BSTOCS_OVER_CURRENT_VALUE	\
	(AW_PID_2113_BSTOCS_OVER_CURRENT << AW_PID_2113_BSTOCS_START_BIT)

#define AW_PID_2113_BSTOCS_DEFAULT_VALUE	(0)
#define AW_PID_2113_BSTOCS_DEFAULT	\
	(AW_PID_2113_BSTOCS_DEFAULT_VALUE << AW_PID_2113_BSTOCS_START_BIT)

/* OVPS bit 10 (SYSST 0x01) */
#define AW_PID_2113_OVPS_START_BIT	(10)
#define AW_PID_2113_OVPS_BITS_LEN	(1)
#define AW_PID_2113_OVPS_MASK	\
	(~(((1<<AW_PID_2113_OVPS_BITS_LEN)-1) << AW_PID_2113_OVPS_START_BIT))

#define AW_PID_2113_OVPS_NORMAL	(0)
#define AW_PID_2113_OVPS_NORMAL_VALUE	\
	(AW_PID_2113_OVPS_NORMAL << AW_PID_2113_OVPS_START_BIT)

#define AW_PID_2113_OVPS_OVP	(1)
#define AW_PID_2113_OVPS_OVP_VALUE	\
	(AW_PID_2113_OVPS_OVP << AW_PID_2113_OVPS_START_BIT)

#define AW_PID_2113_OVPS_DEFAULT_VALUE	(0)
#define AW_PID_2113_OVPS_DEFAULT	\
	(AW_PID_2113_OVPS_DEFAULT_VALUE << AW_PID_2113_OVPS_START_BIT)

/* BSTS bit 9 (SYSST 0x01) */
#define AW_PID_2113_BSTS_START_BIT	(9)
#define AW_PID_2113_BSTS_BITS_LEN	(1)
#define AW_PID_2113_BSTS_MASK	\
	(~(((1<<AW_PID_2113_BSTS_BITS_LEN)-1) << AW_PID_2113_BSTS_START_BIT))

#define AW_PID_2113_BSTS_NOT_FINISHED	(0)
#define AW_PID_2113_BSTS_NOT_FINISHED_VALUE	\
	(AW_PID_2113_BSTS_NOT_FINISHED << AW_PID_2113_BSTS_START_BIT)

#define AW_PID_2113_BSTS_FINISHED	(1)
#define AW_PID_2113_BSTS_FINISHED_VALUE	\
	(AW_PID_2113_BSTS_FINISHED << AW_PID_2113_BSTS_START_BIT)

#define AW_PID_2113_BSTS_DEFAULT_VALUE	(0)
#define AW_PID_2113_BSTS_DEFAULT	\
	(AW_PID_2113_BSTS_DEFAULT_VALUE << AW_PID_2113_BSTS_START_BIT)

/* SWS bit 8 (SYSST 0x01) */
#define AW_PID_2113_SWS_START_BIT	(8)
#define AW_PID_2113_SWS_BITS_LEN	(1)
#define AW_PID_2113_SWS_MASK	\
	(~(((1<<AW_PID_2113_SWS_BITS_LEN)-1) << AW_PID_2113_SWS_START_BIT))

#define AW_PID_2113_SWS_NOT_SWITCHING	(0)
#define AW_PID_2113_SWS_NOT_SWITCHING_VALUE	\
	(AW_PID_2113_SWS_NOT_SWITCHING << AW_PID_2113_SWS_START_BIT)

#define AW_PID_2113_SWS_SWITCHING	(1)
#define AW_PID_2113_SWS_SWITCHING_VALUE	\
	(AW_PID_2113_SWS_SWITCHING << AW_PID_2113_SWS_START_BIT)

#define AW_PID_2113_SWS_DEFAULT_VALUE	(0)
#define AW_PID_2113_SWS_DEFAULT	\
	(AW_PID_2113_SWS_DEFAULT_VALUE << AW_PID_2113_SWS_START_BIT)

/* CLIPS bit 7 (SYSST 0x01) */
#define AW_PID_2113_CLIPS_START_BIT	(7)
#define AW_PID_2113_CLIPS_BITS_LEN	(1)
#define AW_PID_2113_CLIPS_MASK	\
	(~(((1<<AW_PID_2113_CLIPS_BITS_LEN)-1) << AW_PID_2113_CLIPS_START_BIT))

#define AW_PID_2113_CLIPS_NOT_CLIPPING	(0)
#define AW_PID_2113_CLIPS_NOT_CLIPPING_VALUE	\
	(AW_PID_2113_CLIPS_NOT_CLIPPING << AW_PID_2113_CLIPS_START_BIT)

#define AW_PID_2113_CLIPS_CLIPPING	(1)
#define AW_PID_2113_CLIPS_CLIPPING_VALUE	\
	(AW_PID_2113_CLIPS_CLIPPING << AW_PID_2113_CLIPS_START_BIT)

#define AW_PID_2113_CLIPS_DEFAULT_VALUE	(0)
#define AW_PID_2113_CLIPS_DEFAULT	\
	(AW_PID_2113_CLIPS_DEFAULT_VALUE << AW_PID_2113_CLIPS_START_BIT)

/* WDS bit 6 (SYSST 0x01) */
#define AW_PID_2113_WDS_START_BIT	(6)
#define AW_PID_2113_WDS_BITS_LEN	(1)
#define AW_PID_2113_WDS_MASK	\
	(~(((1<<AW_PID_2113_WDS_BITS_LEN)-1) << AW_PID_2113_WDS_START_BIT))

#define AW_PID_2113_WDS_NORMAL	(0)
#define AW_PID_2113_WDS_NORMAL_VALUE	\
	(AW_PID_2113_WDS_NORMAL << AW_PID_2113_WDS_START_BIT)

#define AW_PID_2113_WDS_ABNORMAL	(1)
#define AW_PID_2113_WDS_ABNORMAL_VALUE	\
	(AW_PID_2113_WDS_ABNORMAL << AW_PID_2113_WDS_START_BIT)

#define AW_PID_2113_WDS_DEFAULT_VALUE	(0)
#define AW_PID_2113_WDS_DEFAULT	\
	(AW_PID_2113_WDS_DEFAULT_VALUE << AW_PID_2113_WDS_START_BIT)

/* NOCLKS bit 5 (SYSST 0x01) */
#define AW_PID_2113_NOCLKS_START_BIT	(5)
#define AW_PID_2113_NOCLKS_BITS_LEN	(1)
#define AW_PID_2113_NOCLKS_MASK	\
	(~(((1<<AW_PID_2113_NOCLKS_BITS_LEN)-1) << AW_PID_2113_NOCLKS_START_BIT))

#define AW_PID_2113_NOCLKS_CLOCK_OK	(0)
#define AW_PID_2113_NOCLKS_CLOCK_OK_VALUE	\
	(AW_PID_2113_NOCLKS_CLOCK_OK << AW_PID_2113_NOCLKS_START_BIT)

#define AW_PID_2113_NOCLKS_NO_CLOCK	(1)
#define AW_PID_2113_NOCLKS_NO_CLOCK_VALUE	\
	(AW_PID_2113_NOCLKS_NO_CLOCK << AW_PID_2113_NOCLKS_START_BIT)

#define AW_PID_2113_NOCLKS_DEFAULT_VALUE	(0)
#define AW_PID_2113_NOCLKS_DEFAULT	\
	(AW_PID_2113_NOCLKS_DEFAULT_VALUE << AW_PID_2113_NOCLKS_START_BIT)

