LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
/* CLKS bit 4 (SYSST 0x01) */
#define AW_PID_2113_CLKS_START_BIT	(4)
#define AW_PID_2113_CLKS_BITS_LEN	(1)
#define AW_PID_2113_CLKS_MASK	\
	(~(((1<<AW_PID_2113_CLKS_BITS_LEN)-1) << AW_PID_2113_CLKS_START_BIT))

#define AW_PID_2113_CLKS_NOT_STABLE	(0)
#define AW_PID_2113_CLKS_NOT_STABLE_VALUE	\
	(AW_PID_2113_CLKS_NOT_STABLE << AW_PID_2113_CLKS_START_BIT)

#define AW_PID_2113_CLKS_STABLE	(1)
#define AW_PID_2113_CLKS_STABLE_VALUE	\
	(AW_PID_2113_CLKS_STABLE << AW_PID_2113_CLKS_START_BIT)

#define AW_PID_2113_CLKS_DEFAULT_VALUE	(0)
#define AW_PID_2113_CLKS_DEFAULT	\
	(AW_PID_2113_CLKS_DEFAULT_VALUE << AW_PID_2113_CLKS_START_BIT)

/* OCDS bit 3 (SYSST 0x01) */
#define AW_PID_2113_OCDS_START_BIT	(3)
#define AW_PID_2113_OCDS_BITS_LEN	(1)
#define AW_PID_2113_OCDS_MASK	\
	(~(((1<<AW_PID_2113_OCDS_BITS_LEN)-1) << AW_PID_2113_OCDS_START_BIT))

#define AW_PID_2113_OCDS_NORAML	(0)
#define AW_PID_2113_OCDS_NORAML_VALUE	\
	(AW_PID_2113_OCDS_NORAML << AW_PID_2113_OCDS_START_BIT)

#define AW_PID_2113_OCDS_OC	(1)
#define AW_PID_2113_OCDS_OC_VALUE	\
	(AW_PID_2113_OCDS_OC << AW_PID_2113_OCDS_START_BIT)

#define AW_PID_2113_OCDS_DEFAULT_VALUE	(0)
#define AW_PID_2113_OCDS_DEFAULT	\
	(AW_PID_2113_OCDS_DEFAULT_VALUE << AW_PID_2113_OCDS_START_BIT)

/* BOPS bit 2 (SYSST 0x01) */
#define AW_PID_2113_BOPS_START_BIT	(2)
#define AW_PID_2113_BOPS_BITS_LEN	(1)
#define AW_PID_2113_BOPS_MASK	\
	(~(((1<<AW_PID_2113_BOPS_BITS_LEN)-1) << AW_PID_2113_BOPS_START_BIT))

#define AW_PID_2113_BOPS_NOT_TRIGGERED	(0)
#define AW_PID_2113_BOPS_NOT_TRIGGERED_VALUE	\
	(AW_PID_2113_BOPS_NOT_TRIGGERED << AW_PID_2113_BOPS_START_BIT)

#define AW_PID_2113_BOPS_TRIGGERED	(1)
#define AW_PID_2113_BOPS_TRIGGERED_VALUE	\
	(AW_PID_2113_BOPS_TRIGGERED << AW_PID_2113_BOPS_START_BIT)

#define AW_PID_2113_BOPS_DEFAULT_VALUE	(0)
#define AW_PID_2113_BOPS_DEFAULT	\
	(AW_PID_2113_BOPS_DEFAULT_VALUE << AW_PID_2113_BOPS_START_BIT)

/* OTHS bit 1 (SYSST 0x01) */
#define AW_PID_2113_OTHS_START_BIT	(1)
#define AW_PID_2113_OTHS_BITS_LEN	(1)
#define AW_PID_2113_OTHS_MASK	\
	(~(((1<<AW_PID_2113_OTHS_BITS_LEN)-1) << AW_PID_2113_OTHS_START_BIT))

#define AW_PID_2113_OTHS_NORMAL	(0)
#define AW_PID_2113_OTHS_NORMAL_VALUE	\
	(AW_PID_2113_OTHS_NORMAL << AW_PID_2113_OTHS_START_BIT)

#define AW_PID_2113_OTHS_OT	(1)
#define AW_PID_2113_OTHS_OT_VALUE	\
	(AW_PID_2113_OTHS_OT << AW_PID_2113_OTHS_START_BIT)

#define AW_PID_2113_OTHS_DEFAULT_VALUE	(0)
#define AW_PID_2113_OTHS_DEFAULT	\
	(AW_PID_2113_OTHS_DEFAULT_VALUE << AW_PID_2113_OTHS_START_BIT)

/* PLLS bit 0 (SYSST 0x01) */
#define AW_PID_2113_PLLS_START_BIT	(0)
#define AW_PID_2113_PLLS_BITS_LEN	(1)
#define AW_PID_2113_PLLS_MASK	\
	(~(((1<<AW_PID_2113_PLLS_BITS_LEN)-1) << AW_PID_2113_PLLS_START_BIT))

#define AW_PID_2113_PLLS_UNLOCKED	(0)
#define AW_PID_2113_PLLS_UNLOCKED_VALUE	\
	(AW_PID_2113_PLLS_UNLOCKED << AW_PID_2113_PLLS_START_BIT)

#define AW_PID_2113_PLLS_LOCKED	(1)
#define AW_PID_2113_PLLS_LOCKED_VALUE	\
	(AW_PID_2113_PLLS_LOCKED << AW_PID_2113_PLLS_START_BIT)

#define AW_PID_2113_PLLS_DEFAULT_VALUE	(0)
#define AW_PID_2113_PLLS_DEFAULT	\
	(AW_PID_2113_PLLS_DEFAULT_VALUE << AW_PID_2113_PLLS_START_BIT)

/* default value of SYSST (0x01) */
/* #define AW_PID_2113_SYSST_DEFAULT		(0x0000) */

#define AW_PID_2113_SYSST_CHECK_MASK \
	(~(AW_PID_2113_UVLS_UVLO_VALUE | \
	AW_PID_2113_BSTOCS_OVER_CURRENT_VALUE | \
	AW_PID_2113_BSTS_FINISHED_VALUE | \
	AW_PID_2113_SWS_SWITCHING_VALUE | \
	AW_PID_2113_NOCLKS_NO_CLOCK_VALUE | \
	AW_PID_2113_CLKS_STABLE_VALUE | \
	AW_PID_2113_OCDS_OC_VALUE | \
	AW_PID_2113_OTHS_OT_VALUE | \
	AW_PID_2113_PLLS_LOCKED_VALUE))

#define AW_PID_2113_SYSST_CHECK \
	(AW_PID_2113_BSTS_FINISHED_VALUE | \
	AW_PID_2113_SWS_SWITCHING_VALUE | \
	AW_PID_2113_CLKS_STABLE_VALUE | \
	AW_PID_2113_PLLS_LOCKED_VALUE)

/* SYSINT (0x02) detail */
/* OVP2I bit 15 (SYSINT 0x02) */
#define AW_PID_2113_OVP2I_START_BIT	(15)
#define AW_PID_2113_OVP2I_BITS_LEN	(1)
#define AW_PID_2113_OVP2I_MASK	\
	(~(((1<<AW_PID_2113_OVP2I_BITS_LEN)-1) << AW_PID_2113_OVP2I_START_BIT))

#define AW_PID_2113_OVP2I_DEFAULT_VALUE	(0)
#define AW_PID_2113_OVP2I_DEFAULT	\
	(AW_PID_2113_OVP2I_DEFAULT_VALUE << AW_PID_2113_OVP2I_START_BIT)

/* UVLI bit 14 (SYSINT 0x02) */
#define AW_PID_2113_UVLI_START_BIT	(14)
#define AW_PID_2113_UVLI_BITS_LEN	(1)
#define AW_PID_2113_UVLI_MASK	\
	(~(((1<<AW_PID_2113_UVLI_BITS_LEN)-1) << AW_PID_2113_UVLI_START_BIT))

#define AW_PID_2113_UVLI_DEFAULT_VALUE	(0)
#define AW_PID_2113_UVLI_DEFAULT	\
	(AW_PID_2113_UVLI_DEFAULT_VALUE << AW_PID_2113_UVLI_START_BIT)

/* ADPI bit 13 (SYSINT 0x02) */
#define AW_PID_2113_ADPI_START_BIT	(13)
#define AW_PID_2113_ADPI_BITS_LEN	(1)
#define AW_PID_2113_ADPI_MASK	\
	(~(((1<<AW_PID_2113_ADPI_BITS_LEN)-1) << AW_PID_2113_ADPI_START_BIT))

#define AW_PID_2113_ADPI_DEFAULT_VALUE	(0)
#define AW_PID_2113_ADPI_DEFAULT	\
	(AW_PID_2113_ADPI_DEFAULT_VALUE << AW_PID_2113_ADPI_START_BIT)

/* DSPI bit 12 (SYSINT 0x02) */
#define AW_PID_2113_DSPI_START_BIT	(12)
#define AW_PID_2113_DSPI_BITS_LEN	(1)
#define AW_PID_2113_DSPI_MASK	\
	(~(((1<<AW_PID_2113_DSPI_BITS_LEN)-1) << AW_PID_2113_DSPI_START_BIT))

#define AW_PID_2113_DSPI_DEFAULT_VALUE	(0)
#define AW_PID_2113_DSPI_DEFAULT	\
	(AW_PID_2113_DSPI_DEFAULT_VALUE << AW_PID_2113_DSPI_START_BIT)

/* BSTOCI bit 11 (SYSINT 0x02) */
#define AW_PID_2113_BSTOCI_START_BIT	(11)
#define AW_PID_2113_BSTOCI_BITS_LEN	(1)
#define AW_PID_2113_BSTOCI_MASK	\
	(~(((1<<AW_PID_2113_BSTOCI_BITS_LEN)-1) << AW_PID_2113_BSTOCI_START_BIT))

#define AW_PID_2113_BSTOCI_DEFAULT_VALUE	(0)
#define AW_PID_2113_BSTOCI_DEFAULT	\
	(AW_PID_2113_BSTOCI_DEFAULT_VALUE << AW_PID_2113_BSTOCI_START_BIT)

/* OVPI bit 10 (SYSINT 0x02) */
#define AW_PID_2113_OVPI_START_BIT	(10)
#define AW_PID_2113_OVPI_BITS_LEN	(1)
#define AW_PID_2113_OVPI_MASK	\
	(~(((1<<AW_PID_2113_OVPI_BITS_LEN)-1) << AW_PID_2113_OVPI_START_BIT))

#define AW_PID_2113_OVPI_DEFAULT_VALUE	(0)
#define AW_PID_2113_OVPI_DEFAULT	\
	(AW_PID_2113_OVPI_DEFAULT_VALUE << AW_PID_2113_OVPI_START_BIT)

/* BSTI bit 9 (SYSINT 0x02) */
#define AW_PID_2113_BSTI_START_BIT	(9)
#define AW_PID_2113_BSTI_BITS_LEN	(1)
#define AW_PID_2113_BSTI_MASK	\
	(~(((1<<AW_PID_2113_BSTI_BITS_LEN)-1) << AW_PID_2113_BSTI_START_BIT))

#define AW_PID_2113_BSTI_DEFAULT_VALUE	(0)
#define AW_PID_2113_BSTI_DEFAULT	\
	(AW_PID_2113_BSTI_DEFAULT_VALUE << AW_PID_2113_BSTI_START_BIT)

/* SWI bit 8 (SYSINT 0x02) */
#define AW_PID_2113_SWI_START_BIT	(8)
#define AW_PID_2113_SWI_BITS_LEN	(1)
#define AW_PID_2113_SWI_MASK	\
	(~(((1<<AW_PID_2113_SWI_BITS_LEN)-1) << AW_PID_2113_SWI_START_BIT))

#define AW_PID_2113_SWI_DEFAULT_VALUE	(0)
#define AW_PID_2113_SWI_DEFAULT	\
	(AW_PID_2113_SWI_DEFAULT_VALUE << AW_PID_2113_SWI_START_BIT)

/* CLIPI bit 7 (SYSINT 0x02) */
#define AW_PID_2113_CLIPI_START_BIT	(7)
#define AW_PID_2113_CLIPI_BITS_LEN	(1)
#define AW_PID_2113_CLIPI_MASK	\
	(~(((1<<AW_PID_2113_CLIPI_BITS_LEN)-1) << AW_PID_2113_CLIPI_START_BIT))

#define AW_PID_2113_CLIPI_DEFAULT_VALUE	(0)
#define AW_PID_2113_CLIPI_DEFAULT	\
	(AW_PID_2113_CLIPI_DEFAULT_VALUE << AW_PID_2113_CLIPI_START_BIT)

/* WDI bit 6 (SYSINT 0x02) */
#define AW_PID_2113_WDI_START_BIT	(6)
#define AW_PID_2113_WDI_BITS_LEN	(1)
#define AW_PID_2113_WDI_MASK	\
	(~(((1<<AW_PID_2113_WDI_BITS_LEN)-1) << AW_PID_2113_WDI_START_BIT))

#define AW_PID_2113_WDI_DEFAULT_VALUE	(0)
#define AW_PID_2113_WDI_DEFAULT	\
	(AW_PID_2113_WDI_DEFAULT_VALUE << AW_PID_2113_WDI_START_BIT)

