LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
/* NOCLKI bit 5 (SYSINT 0x02) */
#define AW_PID_2113_NOCLKI_START_BIT	(5)
#define AW_PID_2113_NOCLKI_BITS_LEN	(1)
#define AW_PID_2113_NOCLKI_MASK	\
	(~(((1<<AW_PID_2113_NOCLKI_BITS_LEN)-1) << AW_PID_2113_NOCLKI_START_BIT))

#define AW_PID_2113_NOCLKI_DEFAULT_VALUE	(0)
#define AW_PID_2113_NOCLKI_DEFAULT	\
	(AW_PID_2113_NOCLKI_DEFAULT_VALUE << AW_PID_2113_NOCLKI_START_BIT)

/* CLKI bit 4 (SYSINT 0x02) */
#define AW_PID_2113_CLKI_START_BIT	(4)
#define AW_PID_2113_CLKI_BITS_LEN	(1)
#define AW_PID_2113_CLKI_MASK	\
	(~(((1<<AW_PID_2113_CLKI_BITS_LEN)-1) << AW_PID_2113_CLKI_START_BIT))

#define AW_PID_2113_CLKI_DEFAULT_VALUE	(0)
#define AW_PID_2113_CLKI_DEFAULT	\
	(AW_PID_2113_CLKI_DEFAULT_VALUE << AW_PID_2113_CLKI_START_BIT)

/* OCDI bit 3 (SYSINT 0x02) */
#define AW_PID_2113_OCDI_START_BIT	(3)
#define AW_PID_2113_OCDI_BITS_LEN	(1)
#define AW_PID_2113_OCDI_MASK	\
	(~(((1<<AW_PID_2113_OCDI_BITS_LEN)-1) << AW_PID_2113_OCDI_START_BIT))

#define AW_PID_2113_OCDI_DEFAULT_VALUE	(0)
#define AW_PID_2113_OCDI_DEFAULT	\
	(AW_PID_2113_OCDI_DEFAULT_VALUE << AW_PID_2113_OCDI_START_BIT)

/* BOPI bit 2 (SYSINT 0x02) */
#define AW_PID_2113_BOPI_START_BIT	(2)
#define AW_PID_2113_BOPI_BITS_LEN	(1)
#define AW_PID_2113_BOPI_MASK	\
	(~(((1<<AW_PID_2113_BOPI_BITS_LEN)-1) << AW_PID_2113_BOPI_START_BIT))

#define AW_PID_2113_BOPI_DEFAULT_VALUE	(0)
#define AW_PID_2113_BOPI_DEFAULT	\
	(AW_PID_2113_BOPI_DEFAULT_VALUE << AW_PID_2113_BOPI_START_BIT)

/* OTHI bit 1 (SYSINT 0x02) */
#define AW_PID_2113_OTHI_START_BIT	(1)
#define AW_PID_2113_OTHI_BITS_LEN	(1)
#define AW_PID_2113_OTHI_MASK	\
	(~(((1<<AW_PID_2113_OTHI_BITS_LEN)-1) << AW_PID_2113_OTHI_START_BIT))

#define AW_PID_2113_OTHI_DEFAULT_VALUE	(0)
#define AW_PID_2113_OTHI_DEFAULT	\
	(AW_PID_2113_OTHI_DEFAULT_VALUE << AW_PID_2113_OTHI_START_BIT)

/* PLLI bit 0 (SYSINT 0x02) */
#define AW_PID_2113_PLLI_START_BIT	(0)
#define AW_PID_2113_PLLI_BITS_LEN	(1)
#define AW_PID_2113_PLLI_MASK	\
	(~(((1<<AW_PID_2113_PLLI_BITS_LEN)-1) << AW_PID_2113_PLLI_START_BIT))

#define AW_PID_2113_PLLI_DEFAULT_VALUE	(0)
#define AW_PID_2113_PLLI_DEFAULT	\
	(AW_PID_2113_PLLI_DEFAULT_VALUE << AW_PID_2113_PLLI_START_BIT)

/* default value of SYSINT (0x02) */
/* #define AW_PID_2113_SYSINT_DEFAULT		(0x0000) */

/* SYSINTM (0x03) detail */
/* OVP2M bit 15 (SYSINTM 0x03) */
#define AW_PID_2113_OVP2M_START_BIT	(15)
#define AW_PID_2113_OVP2M_BITS_LEN	(1)
#define AW_PID_2113_OVP2M_MASK	\
	(~(((1<<AW_PID_2113_OVP2M_BITS_LEN)-1) << AW_PID_2113_OVP2M_START_BIT))

#define AW_PID_2113_OVP2M_DEFAULT_VALUE	(1)
#define AW_PID_2113_OVP2M_DEFAULT	\
	(AW_PID_2113_OVP2M_DEFAULT_VALUE << AW_PID_2113_OVP2M_START_BIT)

/* UVLM bit 14 (SYSINTM 0x03) */
#define AW_PID_2113_UVLM_START_BIT	(14)
#define AW_PID_2113_UVLM_BITS_LEN	(1)
#define AW_PID_2113_UVLM_MASK	\
	(~(((1<<AW_PID_2113_UVLM_BITS_LEN)-1) << AW_PID_2113_UVLM_START_BIT))

#define AW_PID_2113_UVLM_DEFAULT_VALUE	(1)
#define AW_PID_2113_UVLM_DEFAULT	\
	(AW_PID_2113_UVLM_DEFAULT_VALUE << AW_PID_2113_UVLM_START_BIT)

/* ADPM bit 13 (SYSINTM 0x03) */
#define AW_PID_2113_ADPM_START_BIT	(13)
#define AW_PID_2113_ADPM_BITS_LEN	(1)
#define AW_PID_2113_ADPM_MASK	\
	(~(((1<<AW_PID_2113_ADPM_BITS_LEN)-1) << AW_PID_2113_ADPM_START_BIT))

#define AW_PID_2113_ADPM_DEFAULT_VALUE	(1)
#define AW_PID_2113_ADPM_DEFAULT	\
	(AW_PID_2113_ADPM_DEFAULT_VALUE << AW_PID_2113_ADPM_START_BIT)

/* DSPM bit 12 (SYSINTM 0x03) */
#define AW_PID_2113_DSPM_START_BIT	(12)
#define AW_PID_2113_DSPM_BITS_LEN	(1)
#define AW_PID_2113_DSPM_MASK	\
	(~(((1<<AW_PID_2113_DSPM_BITS_LEN)-1) << AW_PID_2113_DSPM_START_BIT))

#define AW_PID_2113_DSPM_DEFAULT_VALUE	(1)
#define AW_PID_2113_DSPM_DEFAULT	\
	(AW_PID_2113_DSPM_DEFAULT_VALUE << AW_PID_2113_DSPM_START_BIT)

/* BSTOCM bit 11 (SYSINTM 0x03) */
#define AW_PID_2113_BSTOCM_START_BIT	(11)
#define AW_PID_2113_BSTOCM_BITS_LEN	(1)
#define AW_PID_2113_BSTOCM_MASK	\
	(~(((1<<AW_PID_2113_BSTOCM_BITS_LEN)-1) << AW_PID_2113_BSTOCM_START_BIT))

#define AW_PID_2113_BSTOCM_DEFAULT_VALUE	(1)
#define AW_PID_2113_BSTOCM_DEFAULT	\
	(AW_PID_2113_BSTOCM_DEFAULT_VALUE << AW_PID_2113_BSTOCM_START_BIT)

/* OVPM bit 10 (SYSINTM 0x03) */
#define AW_PID_2113_OVPM_START_BIT	(10)
#define AW_PID_2113_OVPM_BITS_LEN	(1)
#define AW_PID_2113_OVPM_MASK	\
	(~(((1<<AW_PID_2113_OVPM_BITS_LEN)-1) << AW_PID_2113_OVPM_START_BIT))

#define AW_PID_2113_OVPM_DEFAULT_VALUE	(1)
#define AW_PID_2113_OVPM_DEFAULT	\
	(AW_PID_2113_OVPM_DEFAULT_VALUE << AW_PID_2113_OVPM_START_BIT)

/* BSTM bit 9 (SYSINTM 0x03) */
#define AW_PID_2113_BSTM_START_BIT	(9)
#define AW_PID_2113_BSTM_BITS_LEN	(1)
#define AW_PID_2113_BSTM_MASK	\
	(~(((1<<AW_PID_2113_BSTM_BITS_LEN)-1) << AW_PID_2113_BSTM_START_BIT))

#define AW_PID_2113_BSTM_DEFAULT_VALUE	(1)
#define AW_PID_2113_BSTM_DEFAULT	\
	(AW_PID_2113_BSTM_DEFAULT_VALUE << AW_PID_2113_BSTM_START_BIT)

/* SWM bit 8 (SYSINTM 0x03) */
#define AW_PID_2113_SWM_START_BIT	(8)
#define AW_PID_2113_SWM_BITS_LEN	(1)
#define AW_PID_2113_SWM_MASK	\
	(~(((1<<AW_PID_2113_SWM_BITS_LEN)-1) << AW_PID_2113_SWM_START_BIT))

#define AW_PID_2113_SWM_DEFAULT_VALUE	(1)
#define AW_PID_2113_SWM_DEFAULT	\
	(AW_PID_2113_SWM_DEFAULT_VALUE << AW_PID_2113_SWM_START_BIT)

/* CLIPM bit 7 (SYSINTM 0x03) */
#define AW_PID_2113_CLIPM_START_BIT	(7)
#define AW_PID_2113_CLIPM_BITS_LEN	(1)
#define AW_PID_2113_CLIPM_MASK	\
	(~(((1<<AW_PID_2113_CLIPM_BITS_LEN)-1) << AW_PID_2113_CLIPM_START_BIT))

#define AW_PID_2113_CLIPM_DEFAULT_VALUE	(1)
#define AW_PID_2113_CLIPM_DEFAULT	\
	(AW_PID_2113_CLIPM_DEFAULT_VALUE << AW_PID_2113_CLIPM_START_BIT)

/* WDM bit 6 (SYSINTM 0x03) */
#define AW_PID_2113_WDM_START_BIT	(6)
#define AW_PID_2113_WDM_BITS_LEN	(1)
#define AW_PID_2113_WDM_MASK	\
	(~(((1<<AW_PID_2113_WDM_BITS_LEN)-1) << AW_PID_2113_WDM_START_BIT))

#define AW_PID_2113_WDM_DEFAULT_VALUE	(1)
#define AW_PID_2113_WDM_DEFAULT	\
	(AW_PID_2113_WDM_DEFAULT_VALUE << AW_PID_2113_WDM_START_BIT)

/* NOCLKM bit 5 (SYSINTM 0x03) */
#define AW_PID_2113_NOCLKM_START_BIT	(5)
#define AW_PID_2113_NOCLKM_BITS_LEN	(1)
#define AW_PID_2113_NOCLKM_MASK	\
	(~(((1<<AW_PID_2113_NOCLKM_BITS_LEN)-1) << AW_PID_2113_NOCLKM_START_BIT))

#define AW_PID_2113_NOCLKM_DEFAULT_VALUE	(1)
#define AW_PID_2113_NOCLKM_DEFAULT	\
	(AW_PID_2113_NOCLKM_DEFAULT_VALUE << AW_PID_2113_NOCLKM_START_BIT)

/* CLKM bit 4 (SYSINTM 0x03) */
#define AW_PID_2113_CLKM_START_BIT	(4)
#define AW_PID_2113_CLKM_BITS_LEN	(1)
#define AW_PID_2113_CLKM_MASK	\
	(~(((1<<AW_PID_2113_CLKM_BITS_LEN)-1) << AW_PID_2113_CLKM_START_BIT))

#define AW_PID_2113_CLKM_DEFAULT_VALUE	(1)
#define AW_PID_2113_CLKM_DEFAULT	\
	(AW_PID_2113_CLKM_DEFAULT_VALUE << AW_PID_2113_CLKM_START_BIT)

