LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
/* OCDM bit 3 (SYSINTM 0x03) */
#define AW_PID_2113_OCDM_START_BIT	(3)
#define AW_PID_2113_OCDM_BITS_LEN	(1)
#define AW_PID_2113_OCDM_MASK	\
	(~(((1<<AW_PID_2113_OCDM_BITS_LEN)-1) << AW_PID_2113_OCDM_START_BIT))

#define AW_PID_2113_OCDM_DEFAULT_VALUE	(1)
#define AW_PID_2113_OCDM_DEFAULT	\
	(AW_PID_2113_OCDM_DEFAULT_VALUE << AW_PID_2113_OCDM_START_BIT)

/* BOPM bit 2 (SYSINTM 0x03) */
#define AW_PID_2113_BOPM_START_BIT	(2)
#define AW_PID_2113_BOPM_BITS_LEN	(1)
#define AW_PID_2113_BOPM_MASK	\
	(~(((1<<AW_PID_2113_BOPM_BITS_LEN)-1) << AW_PID_2113_BOPM_START_BIT))

#define AW_PID_2113_BOPM_DEFAULT_VALUE	(1)
#define AW_PID_2113_BOPM_DEFAULT	\
	(AW_PID_2113_BOPM_DEFAULT_VALUE << AW_PID_2113_BOPM_START_BIT)

/* OTHM bit 1 (SYSINTM 0x03) */
#define AW_PID_2113_OTHM_START_BIT	(1)
#define AW_PID_2113_OTHM_BITS_LEN	(1)
#define AW_PID_2113_OTHM_MASK	\
	(~(((1<<AW_PID_2113_OTHM_BITS_LEN)-1) << AW_PID_2113_OTHM_START_BIT))

#define AW_PID_2113_OTHM_DEFAULT_VALUE	(1)
#define AW_PID_2113_OTHM_DEFAULT	\
	(AW_PID_2113_OTHM_DEFAULT_VALUE << AW_PID_2113_OTHM_START_BIT)

/* PLLM bit 0 (SYSINTM 0x03) */
#define AW_PID_2113_PLLM_START_BIT	(0)
#define AW_PID_2113_PLLM_BITS_LEN	(1)
#define AW_PID_2113_PLLM_MASK	\
	(~(((1<<AW_PID_2113_PLLM_BITS_LEN)-1) << AW_PID_2113_PLLM_START_BIT))

#define AW_PID_2113_PLLM_DEFAULT_VALUE	(1)
#define AW_PID_2113_PLLM_DEFAULT	\
	(AW_PID_2113_PLLM_DEFAULT_VALUE << AW_PID_2113_PLLM_START_BIT)

/* default value of SYSINTM (0x03) */
#define AW_PID_2113_SYSINTM_DEFAULT		(0xFFFF)

/* SYSCTRL (0x04) detail */
/* ULS_HMUTE bit 14 (SYSCTRL 0x04) */
#define AW_PID_2113_ULS_HMUTE_START_BIT	(14)
#define AW_PID_2113_ULS_HMUTE_BITS_LEN	(1)
#define AW_PID_2113_ULS_HMUTE_MASK	\
	(~(((1<<AW_PID_2113_ULS_HMUTE_BITS_LEN)-1) << AW_PID_2113_ULS_HMUTE_START_BIT))

#define AW_PID_2113_ULS_HMUTE_DISABLE	(0)
#define AW_PID_2113_ULS_HMUTE_DISABLE_VALUE	\
	(AW_PID_2113_ULS_HMUTE_DISABLE << AW_PID_2113_ULS_HMUTE_START_BIT)

#define AW_PID_2113_ULS_HMUTE_ENABLE	(1)
#define AW_PID_2113_ULS_HMUTE_ENABLE_VALUE	\
	(AW_PID_2113_ULS_HMUTE_ENABLE << AW_PID_2113_ULS_HMUTE_START_BIT)

#define AW_PID_2113_ULS_HMUTE_DEFAULT_VALUE	(0)
#define AW_PID_2113_ULS_HMUTE_DEFAULT	\
	(AW_PID_2113_ULS_HMUTE_DEFAULT_VALUE << AW_PID_2113_ULS_HMUTE_START_BIT)

/* SPK_GAIN bit 13:12 (SYSCTRL 0x04) */
#define AW_PID_2113_SPK_GAIN_START_BIT	(12)
#define AW_PID_2113_SPK_GAIN_BITS_LEN	(2)
#define AW_PID_2113_SPK_GAIN_MASK	\
	(~(((1<<AW_PID_2113_SPK_GAIN_BITS_LEN)-1) << AW_PID_2113_SPK_GAIN_START_BIT))

#define AW_PID_2113_SPK_GAIN_4_AV	(0)
#define AW_PID_2113_SPK_GAIN_4_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_4_AV << AW_PID_2113_SPK_GAIN_START_BIT)

#define AW_PID_2113_SPK_GAIN_6_AV	(1)
#define AW_PID_2113_SPK_GAIN_6_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_6_AV << AW_PID_2113_SPK_GAIN_START_BIT)

#define AW_PID_2113_SPK_GAIN_6P8_AV	(2)
#define AW_PID_2113_SPK_GAIN_6P8_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_6P8_AV << AW_PID_2113_SPK_GAIN_START_BIT)

#define AW_PID_2113_SPK_GAIN_12_AV	(3)
#define AW_PID_2113_SPK_GAIN_12_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_12_AV << AW_PID_2113_SPK_GAIN_START_BIT)

#define AW_PID_2113_SPK_GAIN_DEFAULT_VALUE	(3)
#define AW_PID_2113_SPK_GAIN_DEFAULT	\
	(AW_PID_2113_SPK_GAIN_DEFAULT_VALUE << AW_PID_2113_SPK_GAIN_START_BIT)

/* RMSE bit 11 (SYSCTRL 0x04) */
#define AW_PID_2113_RMSE_START_BIT	(11)
#define AW_PID_2113_RMSE_BITS_LEN	(1)
#define AW_PID_2113_RMSE_MASK	\
	(~(((1<<AW_PID_2113_RMSE_BITS_LEN)-1) << AW_PID_2113_RMSE_START_BIT))

#define AW_PID_2113_RMSE_PEAK_AGC	(0)
#define AW_PID_2113_RMSE_PEAK_AGC_VALUE	\
	(AW_PID_2113_RMSE_PEAK_AGC << AW_PID_2113_RMSE_START_BIT)

#define AW_PID_2113_RMSE_RMS_AGC	(1)
#define AW_PID_2113_RMSE_RMS_AGC_VALUE	\
	(AW_PID_2113_RMSE_RMS_AGC << AW_PID_2113_RMSE_START_BIT)

#define AW_PID_2113_RMSE_DEFAULT_VALUE	(0)
#define AW_PID_2113_RMSE_DEFAULT	\
	(AW_PID_2113_RMSE_DEFAULT_VALUE << AW_PID_2113_RMSE_START_BIT)

/* HAGCE bit 10 (SYSCTRL 0x04) */
#define AW_PID_2113_HAGCE_START_BIT	(10)
#define AW_PID_2113_HAGCE_BITS_LEN	(1)
#define AW_PID_2113_HAGCE_MASK	\
	(~(((1<<AW_PID_2113_HAGCE_BITS_LEN)-1) << AW_PID_2113_HAGCE_START_BIT))

#define AW_PID_2113_HAGCE_DISABLE	(0)
#define AW_PID_2113_HAGCE_DISABLE_VALUE	\
	(AW_PID_2113_HAGCE_DISABLE << AW_PID_2113_HAGCE_START_BIT)

#define AW_PID_2113_HAGCE_ENABLE	(1)
#define AW_PID_2113_HAGCE_ENABLE_VALUE	\
	(AW_PID_2113_HAGCE_ENABLE << AW_PID_2113_HAGCE_START_BIT)

#define AW_PID_2113_HAGCE_DEFAULT_VALUE	(0)
#define AW_PID_2113_HAGCE_DEFAULT	\
	(AW_PID_2113_HAGCE_DEFAULT_VALUE << AW_PID_2113_HAGCE_START_BIT)

/* HDCCE bit 9 (SYSCTRL 0x04) */
#define AW_PID_2113_HDCCE_START_BIT	(9)
#define AW_PID_2113_HDCCE_BITS_LEN	(1)
#define AW_PID_2113_HDCCE_MASK	\
	(~(((1<<AW_PID_2113_HDCCE_BITS_LEN)-1) << AW_PID_2113_HDCCE_START_BIT))

#define AW_PID_2113_HDCCE_DISABLE	(0)
#define AW_PID_2113_HDCCE_DISABLE_VALUE	\
	(AW_PID_2113_HDCCE_DISABLE << AW_PID_2113_HDCCE_START_BIT)

#define AW_PID_2113_HDCCE_ENABLE	(1)
#define AW_PID_2113_HDCCE_ENABLE_VALUE	\
	(AW_PID_2113_HDCCE_ENABLE << AW_PID_2113_HDCCE_START_BIT)

#define AW_PID_2113_HDCCE_DEFAULT_VALUE	(1)
#define AW_PID_2113_HDCCE_DEFAULT	\
	(AW_PID_2113_HDCCE_DEFAULT_VALUE << AW_PID_2113_HDCCE_START_BIT)

/* HMUTE bit 8 (SYSCTRL 0x04) */
#define AW_PID_2113_HMUTE_START_BIT	(8)
#define AW_PID_2113_HMUTE_BITS_LEN	(1)
#define AW_PID_2113_HMUTE_MASK	\
	(~(((1<<AW_PID_2113_HMUTE_BITS_LEN)-1) << AW_PID_2113_HMUTE_START_BIT))

#define AW_PID_2113_HMUTE_DISABLE	(0)
#define AW_PID_2113_HMUTE_DISABLE_VALUE	\
	(AW_PID_2113_HMUTE_DISABLE << AW_PID_2113_HMUTE_START_BIT)

#define AW_PID_2113_HMUTE_ENABLE	(1)
#define AW_PID_2113_HMUTE_ENABLE_VALUE	\
	(AW_PID_2113_HMUTE_ENABLE << AW_PID_2113_HMUTE_START_BIT)

#define AW_PID_2113_HMUTE_DEFAULT_VALUE	(1)
#define AW_PID_2113_HMUTE_DEFAULT	\
	(AW_PID_2113_HMUTE_DEFAULT_VALUE << AW_PID_2113_HMUTE_START_BIT)

/* EN_TRAN bit 7 (SYSCTRL 0x04) */
#define AW_PID_2113_EN_TRAN_START_BIT	(7)
#define AW_PID_2113_EN_TRAN_BITS_LEN	(1)
#define AW_PID_2113_EN_TRAN_MASK	\
	(~(((1<<AW_PID_2113_EN_TRAN_BITS_LEN)-1) << AW_PID_2113_EN_TRAN_START_BIT))

#define AW_PID_2113_EN_TRAN_SPK	(0)
#define AW_PID_2113_EN_TRAN_SPK_VALUE	\
	(AW_PID_2113_EN_TRAN_SPK << AW_PID_2113_EN_TRAN_START_BIT)

