LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_EN_TRAN_RCV	(1)
#define AW_PID_2113_EN_TRAN_RCV_VALUE	\
	(AW_PID_2113_EN_TRAN_RCV << AW_PID_2113_EN_TRAN_START_BIT)

#define AW_PID_2113_EN_TRAN_DEFAULT_VALUE	(0)
#define AW_PID_2113_EN_TRAN_DEFAULT	\
	(AW_PID_2113_EN_TRAN_DEFAULT_VALUE << AW_PID_2113_EN_TRAN_START_BIT)

/* I2SEN bit 6 (SYSCTRL 0x04) */
#define AW_PID_2113_I2SEN_START_BIT	(6)
#define AW_PID_2113_I2SEN_BITS_LEN	(1)
#define AW_PID_2113_I2SEN_MASK	\
	(~(((1<<AW_PID_2113_I2SEN_BITS_LEN)-1) << AW_PID_2113_I2SEN_START_BIT))

#define AW_PID_2113_I2SEN_DISABLE	(0)
#define AW_PID_2113_I2SEN_DISABLE_VALUE	\
	(AW_PID_2113_I2SEN_DISABLE << AW_PID_2113_I2SEN_START_BIT)

#define AW_PID_2113_I2SEN_ENABLE	(1)
#define AW_PID_2113_I2SEN_ENABLE_VALUE	\
	(AW_PID_2113_I2SEN_ENABLE << AW_PID_2113_I2SEN_START_BIT)

#define AW_PID_2113_I2SEN_DEFAULT_VALUE	(1)
#define AW_PID_2113_I2SEN_DEFAULT	\
	(AW_PID_2113_I2SEN_DEFAULT_VALUE << AW_PID_2113_I2SEN_START_BIT)

/* WSINV bit 5 (SYSCTRL 0x04) */
#define AW_PID_2113_WSINV_START_BIT	(5)
#define AW_PID_2113_WSINV_BITS_LEN	(1)
#define AW_PID_2113_WSINV_MASK	\
	(~(((1<<AW_PID_2113_WSINV_BITS_LEN)-1) << AW_PID_2113_WSINV_START_BIT))

#define AW_PID_2113_WSINV_NOT_SWITCH	(0)
#define AW_PID_2113_WSINV_NOT_SWITCH_VALUE	\
	(AW_PID_2113_WSINV_NOT_SWITCH << AW_PID_2113_WSINV_START_BIT)

#define AW_PID_2113_WSINV_SWITCH	(1)
#define AW_PID_2113_WSINV_SWITCH_VALUE	\
	(AW_PID_2113_WSINV_SWITCH << AW_PID_2113_WSINV_START_BIT)

#define AW_PID_2113_WSINV_DEFAULT_VALUE	(0)
#define AW_PID_2113_WSINV_DEFAULT	\
	(AW_PID_2113_WSINV_DEFAULT_VALUE << AW_PID_2113_WSINV_START_BIT)

/* BCKINV bit 4 (SYSCTRL 0x04) */
#define AW_PID_2113_BCKINV_START_BIT	(4)
#define AW_PID_2113_BCKINV_BITS_LEN	(1)
#define AW_PID_2113_BCKINV_MASK	\
	(~(((1<<AW_PID_2113_BCKINV_BITS_LEN)-1) << AW_PID_2113_BCKINV_START_BIT))

#define AW_PID_2113_BCKINV_NOT_INVERT	(0)
#define AW_PID_2113_BCKINV_NOT_INVERT_VALUE	\
	(AW_PID_2113_BCKINV_NOT_INVERT << AW_PID_2113_BCKINV_START_BIT)

#define AW_PID_2113_BCKINV_INVERTED	(1)
#define AW_PID_2113_BCKINV_INVERTED_VALUE	\
	(AW_PID_2113_BCKINV_INVERTED << AW_PID_2113_BCKINV_START_BIT)

#define AW_PID_2113_BCKINV_DEFAULT_VALUE	(0)
#define AW_PID_2113_BCKINV_DEFAULT	\
	(AW_PID_2113_BCKINV_DEFAULT_VALUE << AW_PID_2113_BCKINV_START_BIT)

/* IPLL bit 3 (SYSCTRL 0x04) */
#define AW_PID_2113_IPLL_START_BIT	(3)
#define AW_PID_2113_IPLL_BITS_LEN	(1)
#define AW_PID_2113_IPLL_MASK	\
	(~(((1<<AW_PID_2113_IPLL_BITS_LEN)-1) << AW_PID_2113_IPLL_START_BIT))

#define AW_PID_2113_IPLL_BCK	(0)
#define AW_PID_2113_IPLL_BCK_VALUE	\
	(AW_PID_2113_IPLL_BCK << AW_PID_2113_IPLL_START_BIT)

#define AW_PID_2113_IPLL_WCK	(1)
#define AW_PID_2113_IPLL_WCK_VALUE	\
	(AW_PID_2113_IPLL_WCK << AW_PID_2113_IPLL_START_BIT)

#define AW_PID_2113_IPLL_DEFAULT_VALUE	(0)
#define AW_PID_2113_IPLL_DEFAULT	\
	(AW_PID_2113_IPLL_DEFAULT_VALUE << AW_PID_2113_IPLL_START_BIT)

/* AMPPD bit 1 (SYSCTRL 0x04) */
#define AW_PID_2113_AMPPD_START_BIT	(1)
#define AW_PID_2113_AMPPD_BITS_LEN	(1)
#define AW_PID_2113_AMPPD_MASK	\
	(~(((1<<AW_PID_2113_AMPPD_BITS_LEN)-1) << AW_PID_2113_AMPPD_START_BIT))

#define AW_PID_2113_AMPPD_WORKING	(0)
#define AW_PID_2113_AMPPD_WORKING_VALUE	\
	(AW_PID_2113_AMPPD_WORKING << AW_PID_2113_AMPPD_START_BIT)

#define AW_PID_2113_AMPPD_POWER_DOWN	(1)
#define AW_PID_2113_AMPPD_POWER_DOWN_VALUE	\
	(AW_PID_2113_AMPPD_POWER_DOWN << AW_PID_2113_AMPPD_START_BIT)

#define AW_PID_2113_AMPPD_DEFAULT_VALUE	(1)
#define AW_PID_2113_AMPPD_DEFAULT	\
	(AW_PID_2113_AMPPD_DEFAULT_VALUE << AW_PID_2113_AMPPD_START_BIT)

/* PWDN bit 0 (SYSCTRL 0x04) */
#define AW_PID_2113_PWDN_START_BIT	(0)
#define AW_PID_2113_PWDN_BITS_LEN	(1)
#define AW_PID_2113_PWDN_MASK	\
	(~(((1<<AW_PID_2113_PWDN_BITS_LEN)-1) << AW_PID_2113_PWDN_START_BIT))

#define AW_PID_2113_PWDN_WORKING	(0)
#define AW_PID_2113_PWDN_WORKING_VALUE	\
	(AW_PID_2113_PWDN_WORKING << AW_PID_2113_PWDN_START_BIT)

#define AW_PID_2113_PWDN_POWER_DOWN	(1)
#define AW_PID_2113_PWDN_POWER_DOWN_VALUE	\
	(AW_PID_2113_PWDN_POWER_DOWN << AW_PID_2113_PWDN_START_BIT)

#define AW_PID_2113_PWDN_DEFAULT_VALUE	(1)
#define AW_PID_2113_PWDN_DEFAULT	\
	(AW_PID_2113_PWDN_DEFAULT_VALUE << AW_PID_2113_PWDN_START_BIT)

/* default value of SYSCTRL (0x04) */
/* #define AW_PID_2113_SYSCTRL_DEFAULT		(0x3343) */

/* SYSCTRL2 (0x05) detail */
/* ULS_MODE bit 12 (SYSCTRL2 0x05) */
#define AW_PID_2113_ULS_MODE_START_BIT	(12)
#define AW_PID_2113_ULS_MODE_BITS_LEN	(1)
#define AW_PID_2113_ULS_MODE_MASK	\
	(~(((1<<AW_PID_2113_ULS_MODE_BITS_LEN)-1) << AW_PID_2113_ULS_MODE_START_BIT))

#define AW_PID_2113_ULS_MODE_LEGACY	(0)
#define AW_PID_2113_ULS_MODE_LEGACY_VALUE	\
	(AW_PID_2113_ULS_MODE_LEGACY << AW_PID_2113_ULS_MODE_START_BIT)

#define AW_PID_2113_ULS_MODE_TDM	(1)
#define AW_PID_2113_ULS_MODE_TDM_VALUE	\
	(AW_PID_2113_ULS_MODE_TDM << AW_PID_2113_ULS_MODE_START_BIT)

#define AW_PID_2113_ULS_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2113_ULS_MODE_DEFAULT	\
	(AW_PID_2113_ULS_MODE_DEFAULT_VALUE << AW_PID_2113_ULS_MODE_START_BIT)

/* INTMODE bit 11 (SYSCTRL2 0x05) */
#define AW_PID_2113_INTMODE_START_BIT	(11)
#define AW_PID_2113_INTMODE_BITS_LEN	(1)
#define AW_PID_2113_INTMODE_MASK	\
	(~(((1<<AW_PID_2113_INTMODE_BITS_LEN)-1) << AW_PID_2113_INTMODE_START_BIT))

#define AW_PID_2113_INTMODE_OPENMINUS_DRAIN	(0)
#define AW_PID_2113_INTMODE_OPENMINUS_DRAIN_VALUE	\
	(AW_PID_2113_INTMODE_OPENMINUS_DRAIN << AW_PID_2113_INTMODE_START_BIT)

#define AW_PID_2113_INTMODE_PUSHPULL	(1)
#define AW_PID_2113_INTMODE_PUSHPULL_VALUE	\
	(AW_PID_2113_INTMODE_PUSHPULL << AW_PID_2113_INTMODE_START_BIT)

#define AW_PID_2113_INTMODE_DEFAULT_VALUE	(0)
#define AW_PID_2113_INTMODE_DEFAULT	\
	(AW_PID_2113_INTMODE_DEFAULT_VALUE << AW_PID_2113_INTMODE_START_BIT)

/* INTN bit 10 (SYSCTRL2 0x05) */
#define AW_PID_2113_INTN_START_BIT	(10)
#define AW_PID_2113_INTN_BITS_LEN	(1)
#define AW_PID_2113_INTN_MASK	\
	(~(((1<<AW_PID_2113_INTN_BITS_LEN)-1) << AW_PID_2113_INTN_START_BIT))

