LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_INTN_SYSINT	(0)
#define AW_PID_2113_INTN_SYSINT_VALUE	\
	(AW_PID_2113_INTN_SYSINT << AW_PID_2113_INTN_START_BIT)

#define AW_PID_2113_INTN_SYSST	(1)
#define AW_PID_2113_INTN_SYSST_VALUE	\
	(AW_PID_2113_INTN_SYSST << AW_PID_2113_INTN_START_BIT)

#define AW_PID_2113_INTN_DEFAULT_VALUE	(0)
#define AW_PID_2113_INTN_DEFAULT	\
	(AW_PID_2113_INTN_DEFAULT_VALUE << AW_PID_2113_INTN_START_BIT)

/* VOL bit 9:0 (SYSCTRL2 0x05) */
#define AW_PID_2113_VOL_START_BIT	(0)
#define AW_PID_2113_VOL_BITS_LEN	(10)
#define AW_PID_2113_VOL_MASK	\
	(~(((1<<AW_PID_2113_VOL_BITS_LEN)-1) << AW_PID_2113_VOL_START_BIT))

#define AW_PID_2113_VOL_DEFAULT_VALUE	(0)
#define AW_PID_2113_VOL_DEFAULT	\
	(AW_PID_2113_VOL_DEFAULT_VALUE << AW_PID_2113_VOL_START_BIT)

#define AW_PID_2113_MUTE_VOL	(90 * 8)
#define AW_PID_2113_VOL_STEP_DB	(6 * 8)
/* default value of SYSCTRL2 (0x05) */
/* #define AW_PID_2113_SYSCTRL2_DEFAULT		(0x0000) */

/* I2SCTRL1 (0x06) detail */
/* CFSEL bit 14:12 (I2SCTRL1 0x06) */
#define AW_PID_2113_CFSEL_START_BIT	(12)
#define AW_PID_2113_CFSEL_BITS_LEN	(3)
#define AW_PID_2113_CFSEL_MASK	\
	(~(((1<<AW_PID_2113_CFSEL_BITS_LEN)-1) << AW_PID_2113_CFSEL_START_BIT))

#define AW_PID_2113_CFSEL_HAGC	(0)
#define AW_PID_2113_CFSEL_HAGC_VALUE	\
	(AW_PID_2113_CFSEL_HAGC << AW_PID_2113_CFSEL_START_BIT)

#define AW_PID_2113_CFSEL_SAR_ADO	(1)
#define AW_PID_2113_CFSEL_SAR_ADO_VALUE	\
	(AW_PID_2113_CFSEL_SAR_ADO << AW_PID_2113_CFSEL_START_BIT)

#define AW_PID_2113_CFSEL_IVBT	(2)
#define AW_PID_2113_CFSEL_IVBT_VALUE	\
	(AW_PID_2113_CFSEL_IVBT << AW_PID_2113_CFSEL_START_BIT)

#define AW_PID_2113_CFSEL_IV_SENSE_100_MPD_LP_101_ADP_BOOST_OTHERS_RESERVED	(3)
#define AW_PID_2113_CFSEL_IV_SENSE_100_MPD_LP_101_ADP_BOOST_OTHERS_RESERVED_VALUE	\
	(AW_PID_2113_CFSEL_IV_SENSE_100_MPD_LP_101_ADP_BOOST_OTHERS_RESERVED << AW_PID_2113_CFSEL_START_BIT)

#define AW_PID_2113_CFSEL_DEFAULT_VALUE	(0)
#define AW_PID_2113_CFSEL_DEFAULT	\
	(AW_PID_2113_CFSEL_DEFAULT_VALUE << AW_PID_2113_CFSEL_START_BIT)

/* CHSEL bit 11:10 (I2SCTRL1 0x06) */
#define AW_PID_2113_CHSEL_START_BIT	(10)
#define AW_PID_2113_CHSEL_BITS_LEN	(2)
#define AW_PID_2113_CHSEL_MASK	\
	(~(((1<<AW_PID_2113_CHSEL_BITS_LEN)-1) << AW_PID_2113_CHSEL_START_BIT))

#define AW_PID_2113_CHSEL_RESERVED	(0)
#define AW_PID_2113_CHSEL_RESERVED_VALUE	\
	(AW_PID_2113_CHSEL_RESERVED << AW_PID_2113_CHSEL_START_BIT)

#define AW_PID_2113_CHSEL_LEFT	(1)
#define AW_PID_2113_CHSEL_LEFT_VALUE	\
	(AW_PID_2113_CHSEL_LEFT << AW_PID_2113_CHSEL_START_BIT)

#define AW_PID_2113_CHSEL_RIGHT	(2)
#define AW_PID_2113_CHSEL_RIGHT_VALUE	\
	(AW_PID_2113_CHSEL_RIGHT << AW_PID_2113_CHSEL_START_BIT)

#define AW_PID_2113_CHSEL_MONO	(3)
#define AW_PID_2113_CHSEL_MONO_VALUE	\
	(AW_PID_2113_CHSEL_MONO << AW_PID_2113_CHSEL_START_BIT)

#define AW_PID_2113_CHSEL_DEFAULT_VALUE	(1)
#define AW_PID_2113_CHSEL_DEFAULT	\
	(AW_PID_2113_CHSEL_DEFAULT_VALUE << AW_PID_2113_CHSEL_START_BIT)

/* I2SMD bit 9:8 (I2SCTRL1 0x06) */
#define AW_PID_2113_I2SMD_START_BIT	(8)
#define AW_PID_2113_I2SMD_BITS_LEN	(2)
#define AW_PID_2113_I2SMD_MASK	\
	(~(((1<<AW_PID_2113_I2SMD_BITS_LEN)-1) << AW_PID_2113_I2SMD_START_BIT))

#define AW_PID_2113_I2SMD_PHILIP_STANDARD	(0)
#define AW_PID_2113_I2SMD_PHILIP_STANDARD_VALUE	\
	(AW_PID_2113_I2SMD_PHILIP_STANDARD << AW_PID_2113_I2SMD_START_BIT)

#define AW_PID_2113_I2SMD_MSB_JUSTIFIED	(1)
#define AW_PID_2113_I2SMD_MSB_JUSTIFIED_VALUE	\
	(AW_PID_2113_I2SMD_MSB_JUSTIFIED << AW_PID_2113_I2SMD_START_BIT)

#define AW_PID_2113_I2SMD_LSB_JUSTIFIED	(2)
#define AW_PID_2113_I2SMD_LSB_JUSTIFIED_VALUE	\
	(AW_PID_2113_I2SMD_LSB_JUSTIFIED << AW_PID_2113_I2SMD_START_BIT)

#define AW_PID_2113_I2SMD_RESERVED	(3)
#define AW_PID_2113_I2SMD_RESERVED_VALUE	\
	(AW_PID_2113_I2SMD_RESERVED << AW_PID_2113_I2SMD_START_BIT)

#define AW_PID_2113_I2SMD_DEFAULT_VALUE	(0)
#define AW_PID_2113_I2SMD_DEFAULT	\
	(AW_PID_2113_I2SMD_DEFAULT_VALUE << AW_PID_2113_I2SMD_START_BIT)

/* I2SFS bit 7:6 (I2SCTRL1 0x06) */
#define AW_PID_2113_I2SFS_START_BIT	(6)
#define AW_PID_2113_I2SFS_BITS_LEN	(2)
#define AW_PID_2113_I2SFS_MASK	\
	(~(((1<<AW_PID_2113_I2SFS_BITS_LEN)-1) << AW_PID_2113_I2SFS_START_BIT))

#define AW_PID_2113_I2SFS_16_BITS	(0)
#define AW_PID_2113_I2SFS_16_BITS_VALUE	\
	(AW_PID_2113_I2SFS_16_BITS << AW_PID_2113_I2SFS_START_BIT)

#define AW_PID_2113_I2SFS_20_BITS	(1)
#define AW_PID_2113_I2SFS_20_BITS_VALUE	\
	(AW_PID_2113_I2SFS_20_BITS << AW_PID_2113_I2SFS_START_BIT)

#define AW_PID_2113_I2SFS_24_BITS	(2)
#define AW_PID_2113_I2SFS_24_BITS_VALUE	\
	(AW_PID_2113_I2SFS_24_BITS << AW_PID_2113_I2SFS_START_BIT)

#define AW_PID_2113_I2SFS_32_BITS	(3)
#define AW_PID_2113_I2SFS_32_BITS_VALUE	\
	(AW_PID_2113_I2SFS_32_BITS << AW_PID_2113_I2SFS_START_BIT)

#define AW_PID_2113_I2SFS_DEFAULT_VALUE	(3)
#define AW_PID_2113_I2SFS_DEFAULT	\
	(AW_PID_2113_I2SFS_DEFAULT_VALUE << AW_PID_2113_I2SFS_START_BIT)

/* I2SBCK bit 5:4 (I2SCTRL1 0x06) */
#define AW_PID_2113_I2SBCK_START_BIT	(4)
#define AW_PID_2113_I2SBCK_BITS_LEN	(2)
#define AW_PID_2113_I2SBCK_MASK	\
	(~(((1<<AW_PID_2113_I2SBCK_BITS_LEN)-1) << AW_PID_2113_I2SBCK_START_BIT))

#define AW_PID_2113_I2SBCK_32FS	(0)
#define AW_PID_2113_I2SBCK_32FS_VALUE	\
	(AW_PID_2113_I2SBCK_32FS << AW_PID_2113_I2SBCK_START_BIT)

#define AW_PID_2113_I2SBCK_48FS	(1)
#define AW_PID_2113_I2SBCK_48FS_VALUE	\
	(AW_PID_2113_I2SBCK_48FS << AW_PID_2113_I2SBCK_START_BIT)

#define AW_PID_2113_I2SBCK_64FS	(2)
#define AW_PID_2113_I2SBCK_64FS_VALUE	\
	(AW_PID_2113_I2SBCK_64FS << AW_PID_2113_I2SBCK_START_BIT)

#define AW_PID_2113_I2SBCK_RESERVED	(3)
#define AW_PID_2113_I2SBCK_RESERVED_VALUE	\
	(AW_PID_2113_I2SBCK_RESERVED << AW_PID_2113_I2SBCK_START_BIT)

#define AW_PID_2113_I2SBCK_DEFAULT_VALUE	(2)
#define AW_PID_2113_I2SBCK_DEFAULT	\
	(AW_PID_2113_I2SBCK_DEFAULT_VALUE << AW_PID_2113_I2SBCK_START_BIT)

/* I2SSR bit 3:0 (I2SCTRL1 0x06) */
#define AW_PID_2113_I2SSR_START_BIT	(0)
#define AW_PID_2113_I2SSR_BITS_LEN	(4)
#define AW_PID_2113_I2SSR_MASK	\
	(~(((1<<AW_PID_2113_I2SSR_BITS_LEN)-1) << AW_PID_2113_I2SSR_START_BIT))

#define AW_PID_2113_I2SSR_8_KHZ	(0)
#define AW_PID_2113_I2SSR_8_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_8_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_11_KHZ	(1)
#define AW_PID_2113_I2SSR_11_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_11_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_12_KHZ	(2)
#define AW_PID_2113_I2SSR_12_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_12_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_16_KHZ	(3)
#define AW_PID_2113_I2SSR_16_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_16_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_22_KHZ	(4)
#define AW_PID_2113_I2SSR_22_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_22_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_24_KHZ	(5)
#define AW_PID_2113_I2SSR_24_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_24_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_32_KHZ	(6)
#define AW_PID_2113_I2SSR_32_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_32_KHZ << AW_PID_2113_I2SSR_START_BIT)

