LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_I2SSR_44_KHZ	(7)
#define AW_PID_2113_I2SSR_44_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_44_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_48_KHZ	(8)
#define AW_PID_2113_I2SSR_48_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_48_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_96_KHZ	(9)
#define AW_PID_2113_I2SSR_96_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_96_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_192_KHZ	(10)
#define AW_PID_2113_I2SSR_192_KHZ_VALUE	\
	(AW_PID_2113_I2SSR_192_KHZ << AW_PID_2113_I2SSR_START_BIT)

#define AW_PID_2113_I2SSR_DEFAULT_VALUE	(8)
#define AW_PID_2113_I2SSR_DEFAULT	\
	(AW_PID_2113_I2SSR_DEFAULT_VALUE << AW_PID_2113_I2SSR_START_BIT)

/* default value of I2SCTRL1 (0x06) */
/* #define AW_PID_2113_I2SCTRL1_DEFAULT		(0x04E8) */

/* I2SCTRL2 (0x07) detail */
/* SLOT_NUM bit 14:12 (I2SCTRL2 0x07) */
#define AW_PID_2113_SLOT_NUM_START_BIT	(12)
#define AW_PID_2113_SLOT_NUM_BITS_LEN	(3)
#define AW_PID_2113_SLOT_NUM_MASK	\
	(~(((1<<AW_PID_2113_SLOT_NUM_BITS_LEN)-1) << AW_PID_2113_SLOT_NUM_START_BIT))

#define AW_PID_2113_SLOT_NUM_I2S_MODE	(0)
#define AW_PID_2113_SLOT_NUM_I2S_MODE_VALUE	\
	(AW_PID_2113_SLOT_NUM_I2S_MODE << AW_PID_2113_SLOT_NUM_START_BIT)

#define AW_PID_2113_SLOT_NUM_TDM1S	(1)
#define AW_PID_2113_SLOT_NUM_TDM1S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM1S << AW_PID_2113_SLOT_NUM_START_BIT)

#define AW_PID_2113_SLOT_NUM_TDM2S	(2)
#define AW_PID_2113_SLOT_NUM_TDM2S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM2S << AW_PID_2113_SLOT_NUM_START_BIT)

#define AW_PID_2113_SLOT_NUM_TDM4S	(3)
#define AW_PID_2113_SLOT_NUM_TDM4S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM4S << AW_PID_2113_SLOT_NUM_START_BIT)

#define AW_PID_2113_SLOT_NUM_TDM6S	(4)
#define AW_PID_2113_SLOT_NUM_TDM6S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM6S << AW_PID_2113_SLOT_NUM_START_BIT)

#define AW_PID_2113_SLOT_NUM_TDM8S	(5)
#define AW_PID_2113_SLOT_NUM_TDM8S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM8S << AW_PID_2113_SLOT_NUM_START_BIT)

#define AW_PID_2113_SLOT_NUM_TDM16S	(6)
#define AW_PID_2113_SLOT_NUM_TDM16S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM16S << AW_PID_2113_SLOT_NUM_START_BIT)

/*
#define AW_PID_2113_SLOT_NUM_TDM16S	(7)
#define AW_PID_2113_SLOT_NUM_TDM16S_VALUE	\
	(AW_PID_2113_SLOT_NUM_TDM16S << AW_PID_2113_SLOT_NUM_START_BIT)
*/

#define AW_PID_2113_SLOT_NUM_DEFAULT_VALUE	(0)
#define AW_PID_2113_SLOT_NUM_DEFAULT	\
	(AW_PID_2113_SLOT_NUM_DEFAULT_VALUE << AW_PID_2113_SLOT_NUM_START_BIT)

/* I2S_TX_SLOTVLD bit 11:8 (I2SCTRL2 0x07) */
#define AW_PID_2113_I2S_TX_SLOTVLD_START_BIT	(8)
#define AW_PID_2113_I2S_TX_SLOTVLD_BITS_LEN	(4)
#define AW_PID_2113_I2S_TX_SLOTVLD_MASK	\
	(~(((1<<AW_PID_2113_I2S_TX_SLOTVLD_BITS_LEN)-1) << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT))

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_0	(0)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_0_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_0 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_1	(1)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_1_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_1 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_2	(2)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_2_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_2 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_3	(3)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_3 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_4	(4)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_4 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_5	(5)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_5 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_6	(6)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_6 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_15	(15)
#define AW_PID_2113_I2S_TX_SLOTVLD_SLOT_15_VALUE	\
	(AW_PID_2113_I2S_TX_SLOTVLD_SLOT_15 << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_TX_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_2113_I2S_TX_SLOTVLD_DEFAULT	\
	(AW_PID_2113_I2S_TX_SLOTVLD_DEFAULT_VALUE << AW_PID_2113_I2S_TX_SLOTVLD_START_BIT)

/* I2S_RXR_SLOTVLD bit 7:4 (I2SCTRL2 0x07) */
#define AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT	(4)
#define AW_PID_2113_I2S_RXR_SLOTVLD_BITS_LEN	(4)
#define AW_PID_2113_I2S_RXR_SLOTVLD_MASK	\
	(~(((1<<AW_PID_2113_I2S_RXR_SLOTVLD_BITS_LEN)-1) << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT))

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_0	(0)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_0_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_0 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_1	(1)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_1_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_1 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_2	(2)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_2_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_2 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_3	(3)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_3 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_4	(4)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_4 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_5	(5)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_5 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_6	(6)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_6 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_15	(15)
#define AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_15_VALUE	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_SLOT_15 << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

