LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_I2S_RXR_SLOTVLD_DEFAULT_VALUE	(1)
#define AW_PID_2113_I2S_RXR_SLOTVLD_DEFAULT	\
	(AW_PID_2113_I2S_RXR_SLOTVLD_DEFAULT_VALUE << AW_PID_2113_I2S_RXR_SLOTVLD_START_BIT)

/* I2S_RXL_SLOTVLD bit 3:0 (I2SCTRL2 0x07) */
#define AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT	(0)
#define AW_PID_2113_I2S_RXL_SLOTVLD_BITS_LEN	(4)
#define AW_PID_2113_I2S_RXL_SLOTVLD_MASK	\
	(~(((1<<AW_PID_2113_I2S_RXL_SLOTVLD_BITS_LEN)-1) << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT))

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_0	(0)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_0_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_0 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_1	(1)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_1_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_1 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_2	(2)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_2_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_2 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_3	(3)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_3 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_4	(4)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_4_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_4 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_5	(5)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_5_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_5 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_6	(6)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_6_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_6 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_15	(15)
#define AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_15_VALUE	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_SLOT_15 << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

#define AW_PID_2113_I2S_RXL_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_2113_I2S_RXL_SLOTVLD_DEFAULT	\
	(AW_PID_2113_I2S_RXL_SLOTVLD_DEFAULT_VALUE << AW_PID_2113_I2S_RXL_SLOTVLD_START_BIT)

/* default value of I2SCTRL2 (0x07) */
/* #define AW_PID_2113_I2SCTRL2_DEFAULT		(0x0010) */

/* I2SCTRL3 (0x08) detail */
/* FSYNC_TYPE bit 7 (I2SCTRL3 0x08) */
#define AW_PID_2113_FSYNC_TYPE_START_BIT	(7)
#define AW_PID_2113_FSYNC_TYPE_BITS_LEN	(1)
#define AW_PID_2113_FSYNC_TYPE_MASK	\
	(~(((1<<AW_PID_2113_FSYNC_TYPE_BITS_LEN)-1) << AW_PID_2113_FSYNC_TYPE_START_BIT))

#define AW_PID_2113_FSYNC_TYPE_ONEMINUS_SLOT	(0)
#define AW_PID_2113_FSYNC_TYPE_ONEMINUS_SLOT_VALUE	\
	(AW_PID_2113_FSYNC_TYPE_ONEMINUS_SLOT << AW_PID_2113_FSYNC_TYPE_START_BIT)

#define AW_PID_2113_FSYNC_TYPE_ONEMINUS_BCK	(1)
#define AW_PID_2113_FSYNC_TYPE_ONEMINUS_BCK_VALUE	\
	(AW_PID_2113_FSYNC_TYPE_ONEMINUS_BCK << AW_PID_2113_FSYNC_TYPE_START_BIT)

#define AW_PID_2113_FSYNC_TYPE_DEFAULT_VALUE	(0)
#define AW_PID_2113_FSYNC_TYPE_DEFAULT	\
	(AW_PID_2113_FSYNC_TYPE_DEFAULT_VALUE << AW_PID_2113_FSYNC_TYPE_START_BIT)

/* I2STXEN bit 6 (I2SCTRL3 0x08) */
#define AW_PID_2113_I2STXEN_START_BIT	(6)
#define AW_PID_2113_I2STXEN_BITS_LEN	(1)
#define AW_PID_2113_I2STXEN_MASK	\
	(~(((1<<AW_PID_2113_I2STXEN_BITS_LEN)-1) << AW_PID_2113_I2STXEN_START_BIT))

#define AW_PID_2113_I2STXEN_DISABLE	(0)
#define AW_PID_2113_I2STXEN_DISABLE_VALUE	\
	(AW_PID_2113_I2STXEN_DISABLE << AW_PID_2113_I2STXEN_START_BIT)

#define AW_PID_2113_I2STXEN_ENABLE	(1)
#define AW_PID_2113_I2STXEN_ENABLE_VALUE	\
	(AW_PID_2113_I2STXEN_ENABLE << AW_PID_2113_I2STXEN_START_BIT)

#define AW_PID_2113_I2STXEN_DEFAULT_VALUE	(1)
#define AW_PID_2113_I2STXEN_DEFAULT	\
	(AW_PID_2113_I2STXEN_DEFAULT_VALUE << AW_PID_2113_I2STXEN_START_BIT)

/* DRVSTREN bit 5 (I2SCTRL3 0x08) */
#define AW_PID_2113_DRVSTREN_START_BIT	(5)
#define AW_PID_2113_DRVSTREN_BITS_LEN	(1)
#define AW_PID_2113_DRVSTREN_MASK	\
	(~(((1<<AW_PID_2113_DRVSTREN_BITS_LEN)-1) << AW_PID_2113_DRVSTREN_START_BIT))

#define AW_PID_2113_DRVSTREN_4MA	(0)
#define AW_PID_2113_DRVSTREN_4MA_VALUE	\
	(AW_PID_2113_DRVSTREN_4MA << AW_PID_2113_DRVSTREN_START_BIT)

#define AW_PID_2113_DRVSTREN_12MA	(1)
#define AW_PID_2113_DRVSTREN_12MA_VALUE	\
	(AW_PID_2113_DRVSTREN_12MA << AW_PID_2113_DRVSTREN_START_BIT)

#define AW_PID_2113_DRVSTREN_DEFAULT_VALUE	(1)
#define AW_PID_2113_DRVSTREN_DEFAULT	\
	(AW_PID_2113_DRVSTREN_DEFAULT_VALUE << AW_PID_2113_DRVSTREN_START_BIT)

/* I2SRXEN bit 4 (I2SCTRL3 0x08) */
#define AW_PID_2113_I2SRXEN_START_BIT	(4)
#define AW_PID_2113_I2SRXEN_BITS_LEN	(1)
#define AW_PID_2113_I2SRXEN_MASK	\
	(~(((1<<AW_PID_2113_I2SRXEN_BITS_LEN)-1) << AW_PID_2113_I2SRXEN_START_BIT))

#define AW_PID_2113_I2SRXEN_DISABLE	(0)
#define AW_PID_2113_I2SRXEN_DISABLE_VALUE	\
	(AW_PID_2113_I2SRXEN_DISABLE << AW_PID_2113_I2SRXEN_START_BIT)

#define AW_PID_2113_I2SRXEN_ENABLE	(1)
#define AW_PID_2113_I2SRXEN_ENABLE_VALUE	\
	(AW_PID_2113_I2SRXEN_ENABLE << AW_PID_2113_I2SRXEN_START_BIT)

#define AW_PID_2113_I2SRXEN_DEFAULT_VALUE	(1)
#define AW_PID_2113_I2SRXEN_DEFAULT	\
	(AW_PID_2113_I2SRXEN_DEFAULT_VALUE << AW_PID_2113_I2SRXEN_START_BIT)

/* IV2CH bit 3 (I2SCTRL3 0x08) */
#define AW_PID_2113_IV2CH_START_BIT	(3)
#define AW_PID_2113_IV2CH_BITS_LEN	(1)
#define AW_PID_2113_IV2CH_MASK	\
	(~(((1<<AW_PID_2113_IV2CH_BITS_LEN)-1) << AW_PID_2113_IV2CH_START_BIT))

#define AW_PID_2113_IV2CH_LEGACY	(0)
#define AW_PID_2113_IV2CH_LEGACY_VALUE	\
	(AW_PID_2113_IV2CH_LEGACY << AW_PID_2113_IV2CH_START_BIT)

#define AW_PID_2113_IV2CH_SPECIAL	(1)
#define AW_PID_2113_IV2CH_SPECIAL_VALUE	\
	(AW_PID_2113_IV2CH_SPECIAL << AW_PID_2113_IV2CH_START_BIT)

#define AW_PID_2113_IV2CH_DEFAULT_VALUE	(0)
#define AW_PID_2113_IV2CH_DEFAULT	\
	(AW_PID_2113_IV2CH_DEFAULT_VALUE << AW_PID_2113_IV2CH_START_BIT)

/* I2SDOSEL bit 2 (I2SCTRL3 0x08) */
#define AW_PID_2113_I2SDOSEL_START_BIT	(2)
#define AW_PID_2113_I2SDOSEL_BITS_LEN	(1)
#define AW_PID_2113_I2SDOSEL_MASK	\
	(~(((1<<AW_PID_2113_I2SDOSEL_BITS_LEN)-1) << AW_PID_2113_I2SDOSEL_START_BIT))

#define AW_PID_2113_I2SDOSEL_ZEROS	(0)
#define AW_PID_2113_I2SDOSEL_ZEROS_VALUE	\
	(AW_PID_2113_I2SDOSEL_ZEROS << AW_PID_2113_I2SDOSEL_START_BIT)

#define AW_PID_2113_I2SDOSEL_TXDATA	(1)
#define AW_PID_2113_I2SDOSEL_TXDATA_VALUE	\
	(AW_PID_2113_I2SDOSEL_TXDATA << AW_PID_2113_I2SDOSEL_START_BIT)

#define AW_PID_2113_I2SDOSEL_DEFAULT_VALUE	(1)
#define AW_PID_2113_I2SDOSEL_DEFAULT	\
	(AW_PID_2113_I2SDOSEL_DEFAULT_VALUE << AW_PID_2113_I2SDOSEL_START_BIT)

/* DOHZ bit 1 (I2SCTRL3 0x08) */
#define AW_PID_2113_DOHZ_START_BIT	(1)
#define AW_PID_2113_DOHZ_BITS_LEN	(1)
#define AW_PID_2113_DOHZ_MASK	\
	(~(((1<<AW_PID_2113_DOHZ_BITS_LEN)-1) << AW_PID_2113_DOHZ_START_BIT))

#define AW_PID_2113_DOHZ_ALL	(0)
#define AW_PID_2113_DOHZ_ALL_VALUE	\
	(AW_PID_2113_DOHZ_ALL << AW_PID_2113_DOHZ_START_BIT)

