LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_DOHZ_HIZ	(1)
#define AW_PID_2113_DOHZ_HIZ_VALUE	\
	(AW_PID_2113_DOHZ_HIZ << AW_PID_2113_DOHZ_START_BIT)

#define AW_PID_2113_DOHZ_DEFAULT_VALUE	(1)
#define AW_PID_2113_DOHZ_DEFAULT	\
	(AW_PID_2113_DOHZ_DEFAULT_VALUE << AW_PID_2113_DOHZ_START_BIT)

/* I2SCHS bit 0 (I2SCTRL3 0x08) */
#define AW_PID_2113_I2SCHS_START_BIT	(0)
#define AW_PID_2113_I2SCHS_BITS_LEN	(1)
#define AW_PID_2113_I2SCHS_MASK	\
	(~(((1<<AW_PID_2113_I2SCHS_BITS_LEN)-1) << AW_PID_2113_I2SCHS_START_BIT))

#define AW_PID_2113_I2SCHS_LEFT	(0)
#define AW_PID_2113_I2SCHS_LEFT_VALUE	\
	(AW_PID_2113_I2SCHS_LEFT << AW_PID_2113_I2SCHS_START_BIT)

#define AW_PID_2113_I2SCHS_RIGHT	(1)
#define AW_PID_2113_I2SCHS_RIGHT_VALUE	\
	(AW_PID_2113_I2SCHS_RIGHT << AW_PID_2113_I2SCHS_START_BIT)

#define AW_PID_2113_I2SCHS_DEFAULT_VALUE	(0)
#define AW_PID_2113_I2SCHS_DEFAULT	\
	(AW_PID_2113_I2SCHS_DEFAULT_VALUE << AW_PID_2113_I2SCHS_START_BIT)

/* default value of I2SCTRL3 (0x08) */
/* #define AW_PID_2113_I2SCTRL3_DEFAULT		(0x0076) */

/* DACCFG1 (0x09) detail */
/* RVTH bit 15:8 (DACCFG1 0x09) */
#define AW_PID_2113_RVTH_START_BIT	(8)
#define AW_PID_2113_RVTH_BITS_LEN	(8)
#define AW_PID_2113_RVTH_MASK	\
	(~(((1<<AW_PID_2113_RVTH_BITS_LEN)-1) << AW_PID_2113_RVTH_START_BIT))

#define AW_PID_2113_RVTH_DEFAULT_VALUE	(0x39)
#define AW_PID_2113_RVTH_DEFAULT	\
	(AW_PID_2113_RVTH_DEFAULT_VALUE << AW_PID_2113_RVTH_START_BIT)

/* AVTH bit 7:0 (DACCFG1 0x09) */
#define AW_PID_2113_AVTH_START_BIT	(0)
#define AW_PID_2113_AVTH_BITS_LEN	(8)
#define AW_PID_2113_AVTH_MASK	\
	(~(((1<<AW_PID_2113_AVTH_BITS_LEN)-1) << AW_PID_2113_AVTH_START_BIT))

#define AW_PID_2113_AVTH_DEFAULT_VALUE	(0x40)
#define AW_PID_2113_AVTH_DEFAULT	\
	(AW_PID_2113_AVTH_DEFAULT_VALUE << AW_PID_2113_AVTH_START_BIT)

/* default value of DACCFG1 (0x09) */
/* #define AW_PID_2113_DACCFG1_DEFAULT		(0x3940) */

/* DACCFG2 (0x0A) detail */
/* ATTH bit 15:0 (DACCFG2 0x0A) */
#define AW_PID_2113_ATTH_START_BIT	(0)
#define AW_PID_2113_ATTH_BITS_LEN	(16)
#define AW_PID_2113_ATTH_MASK	\
	(~(((1<<AW_PID_2113_ATTH_BITS_LEN)-1) << AW_PID_2113_ATTH_START_BIT))

#define AW_PID_2113_ATTH_RESERVED	(0)
#define AW_PID_2113_ATTH_RESERVED_VALUE	\
	(AW_PID_2113_ATTH_RESERVED << AW_PID_2113_ATTH_START_BIT)

#define AW_PID_2113_ATTH_DEFAULT_VALUE	(0x0030)
#define AW_PID_2113_ATTH_DEFAULT	\
	(AW_PID_2113_ATTH_DEFAULT_VALUE << AW_PID_2113_ATTH_START_BIT)

/* default value of DACCFG2 (0x0A) */
/* #define AW_PID_2113_DACCFG2_DEFAULT		(0x0030) */

/* DACCFG3 (0x0B) detail */
/* RTTH bit 15:0 (DACCFG3 0x0B) */
#define AW_PID_2113_RTTH_START_BIT	(0)
#define AW_PID_2113_RTTH_BITS_LEN	(16)
#define AW_PID_2113_RTTH_MASK	\
	(~(((1<<AW_PID_2113_RTTH_BITS_LEN)-1) << AW_PID_2113_RTTH_START_BIT))

#define AW_PID_2113_RTTH_RESERVED	(0)
#define AW_PID_2113_RTTH_RESERVED_VALUE	\
	(AW_PID_2113_RTTH_RESERVED << AW_PID_2113_RTTH_START_BIT)

#define AW_PID_2113_RTTH_DEFAULT_VALUE	(0x01E0)
#define AW_PID_2113_RTTH_DEFAULT	\
	(AW_PID_2113_RTTH_DEFAULT_VALUE << AW_PID_2113_RTTH_START_BIT)

/* default value of DACCFG3 (0x0B) */
/* #define AW_PID_2113_DACCFG3_DEFAULT		(0x01E0) */

/* DACCFG4 (0x0C) detail */
/* IIC_GEN_ADDR bit 15:9 (DACCFG4 0x0C) */
#define AW_PID_2113_IIC_GEN_ADDR_START_BIT	(9)
#define AW_PID_2113_IIC_GEN_ADDR_BITS_LEN	(7)
#define AW_PID_2113_IIC_GEN_ADDR_MASK	\
	(~(((1<<AW_PID_2113_IIC_GEN_ADDR_BITS_LEN)-1) << AW_PID_2113_IIC_GEN_ADDR_START_BIT))

#define AW_PID_2113_IIC_GEN_ADDR_DEFAULT_VALUE	(0x0E)
#define AW_PID_2113_IIC_GEN_ADDR_DEFAULT	\
	(AW_PID_2113_IIC_GEN_ADDR_DEFAULT_VALUE << AW_PID_2113_IIC_GEN_ADDR_START_BIT)

/* IIC_GEN_EN bit 8 (DACCFG4 0x0C) */
#define AW_PID_2113_IIC_GEN_EN_START_BIT	(8)
#define AW_PID_2113_IIC_GEN_EN_BITS_LEN	(1)
#define AW_PID_2113_IIC_GEN_EN_MASK	\
	(~(((1<<AW_PID_2113_IIC_GEN_EN_BITS_LEN)-1) << AW_PID_2113_IIC_GEN_EN_START_BIT))

#define AW_PID_2113_IIC_GEN_EN_DISABLE	(0)
#define AW_PID_2113_IIC_GEN_EN_DISABLE_VALUE	\
	(AW_PID_2113_IIC_GEN_EN_DISABLE << AW_PID_2113_IIC_GEN_EN_START_BIT)

#define AW_PID_2113_IIC_GEN_EN_ENABLE	(1)
#define AW_PID_2113_IIC_GEN_EN_ENABLE_VALUE	\
	(AW_PID_2113_IIC_GEN_EN_ENABLE << AW_PID_2113_IIC_GEN_EN_START_BIT)

#define AW_PID_2113_IIC_GEN_EN_DEFAULT_VALUE	(0)
#define AW_PID_2113_IIC_GEN_EN_DEFAULT	\
	(AW_PID_2113_IIC_GEN_EN_DEFAULT_VALUE << AW_PID_2113_IIC_GEN_EN_START_BIT)

/* HOLDTH bit 7:0 (DACCFG4 0x0C) */
#define AW_PID_2113_HOLDTH_START_BIT	(0)
#define AW_PID_2113_HOLDTH_BITS_LEN	(8)
#define AW_PID_2113_HOLDTH_MASK	\
	(~(((1<<AW_PID_2113_HOLDTH_BITS_LEN)-1) << AW_PID_2113_HOLDTH_START_BIT))

#define AW_PID_2113_HOLDTH_RESERVED	(0)
#define AW_PID_2113_HOLDTH_RESERVED_VALUE	\
	(AW_PID_2113_HOLDTH_RESERVED << AW_PID_2113_HOLDTH_START_BIT)

#define AW_PID_2113_HOLDTH_DEFAULT_VALUE	(0x64)
#define AW_PID_2113_HOLDTH_DEFAULT	\
	(AW_PID_2113_HOLDTH_DEFAULT_VALUE << AW_PID_2113_HOLDTH_START_BIT)

/* default value of DACCFG4 (0x0C) */
/* #define AW_PID_2113_DACCFG4_DEFAULT		(0x1C64) */

/* DACST (0x20) detail */
/* BST_IPEAK_ST bit 15:12 (DACST 0x20) */
#define AW_PID_2113_BST_IPEAK_ST_START_BIT	(12)
#define AW_PID_2113_BST_IPEAK_ST_BITS_LEN	(4)
#define AW_PID_2113_BST_IPEAK_ST_MASK	\
	(~(((1<<AW_PID_2113_BST_IPEAK_ST_BITS_LEN)-1) << AW_PID_2113_BST_IPEAK_ST_START_BIT))

#define AW_PID_2113_BST_IPEAK_ST_DEFAULT_VALUE	(0)
#define AW_PID_2113_BST_IPEAK_ST_DEFAULT	\
	(AW_PID_2113_BST_IPEAK_ST_DEFAULT_VALUE << AW_PID_2113_BST_IPEAK_ST_START_BIT)

/* SPK_GAIN_ST bit 9:8 (DACST 0x20) */
#define AW_PID_2113_SPK_GAIN_ST_START_BIT	(8)
#define AW_PID_2113_SPK_GAIN_ST_BITS_LEN	(2)
#define AW_PID_2113_SPK_GAIN_ST_MASK	\
	(~(((1<<AW_PID_2113_SPK_GAIN_ST_BITS_LEN)-1) << AW_PID_2113_SPK_GAIN_ST_START_BIT))

#define AW_PID_2113_SPK_GAIN_ST_4_AV	(0)
#define AW_PID_2113_SPK_GAIN_ST_4_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_ST_4_AV << AW_PID_2113_SPK_GAIN_ST_START_BIT)

#define AW_PID_2113_SPK_GAIN_ST_6P0_AV	(1)
#define AW_PID_2113_SPK_GAIN_ST_6P0_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_ST_6P0_AV << AW_PID_2113_SPK_GAIN_ST_START_BIT)

#define AW_PID_2113_SPK_GAIN_ST_6P8P0_AV	(2)
#define AW_PID_2113_SPK_GAIN_ST_6P8P0_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_ST_6P8P0_AV << AW_PID_2113_SPK_GAIN_ST_START_BIT)

#define AW_PID_2113_SPK_GAIN_ST_12P0_AV	(3)
#define AW_PID_2113_SPK_GAIN_ST_12P0_AV_VALUE	\
	(AW_PID_2113_SPK_GAIN_ST_12P0_AV << AW_PID_2113_SPK_GAIN_ST_START_BIT)

#define AW_PID_2113_SPK_GAIN_ST_DEFAULT_VALUE	(3)
#define AW_PID_2113_SPK_GAIN_ST_DEFAULT	\
	(AW_PID_2113_SPK_GAIN_ST_DEFAULT_VALUE << AW_PID_2113_SPK_GAIN_ST_START_BIT)

/* ZERO_RST_SYNC bit 7 (DACST 0x20) */
#define AW_PID_2113_ZERO_RST_SYNC_START_BIT	(7)
#define AW_PID_2113_ZERO_RST_SYNC_BITS_LEN	(1)
#define AW_PID_2113_ZERO_RST_SYNC_MASK	\
	(~(((1<<AW_PID_2113_ZERO_RST_SYNC_BITS_LEN)-1) << AW_PID_2113_ZERO_RST_SYNC_START_BIT))

#define AW_PID_2113_ZERO_RST_SYNC_DEFAULT_VALUE	(0)
#define AW_PID_2113_ZERO_RST_SYNC_DEFAULT	\
	(AW_PID_2113_ZERO_RST_SYNC_DEFAULT_VALUE << AW_PID_2113_ZERO_RST_SYNC_START_BIT)

