LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
/* BSTVOUT_ST bit 6:0 (DACST 0x20) */
#define AW_PID_2113_BSTVOUT_ST_START_BIT	(0)
#define AW_PID_2113_BSTVOUT_ST_BITS_LEN	(7)
#define AW_PID_2113_BSTVOUT_ST_MASK	\
	(~(((1<<AW_PID_2113_BSTVOUT_ST_BITS_LEN)-1) << AW_PID_2113_BSTVOUT_ST_START_BIT))

#define AW_PID_2113_BSTVOUT_ST_3P25V	(0)
#define AW_PID_2113_BSTVOUT_ST_3P25V_VALUE	\
	(AW_PID_2113_BSTVOUT_ST_3P25V << AW_PID_2113_BSTVOUT_ST_START_BIT)

#define AW_PID_2113_BSTVOUT_ST_3P50V	(1)
#define AW_PID_2113_BSTVOUT_ST_3P50V_VALUE	\
	(AW_PID_2113_BSTVOUT_ST_3P50V << AW_PID_2113_BSTVOUT_ST_START_BIT)

#define AW_PID_2113_BSTVOUT_ST_3P75V	(2)
#define AW_PID_2113_BSTVOUT_ST_3P75V_VALUE	\
	(AW_PID_2113_BSTVOUT_ST_3P75V << AW_PID_2113_BSTVOUT_ST_START_BIT)

#define AW_PID_2113_BSTVOUT_ST_7P00V	(15)
#define AW_PID_2113_BSTVOUT_ST_7P00V_VALUE	\
	(AW_PID_2113_BSTVOUT_ST_7P00V << AW_PID_2113_BSTVOUT_ST_START_BIT)

#define AW_PID_2113_BSTVOUT_ST_DEFAULT_VALUE	(0)
#define AW_PID_2113_BSTVOUT_ST_DEFAULT	\
	(AW_PID_2113_BSTVOUT_ST_DEFAULT_VALUE << AW_PID_2113_BSTVOUT_ST_START_BIT)

/* default value of DACST (0x20) */
/* #define AW_PID_2113_DACST_DEFAULT		(0x0300) */

/* VBAT (0x21) detail */
/* VBAT_DET bit 9:0 (VBAT 0x21) */
#define AW_PID_2113_VBAT_DET_START_BIT	(0)
#define AW_PID_2113_VBAT_DET_BITS_LEN	(10)
#define AW_PID_2113_VBAT_DET_MASK	\
	(~(((1<<AW_PID_2113_VBAT_DET_BITS_LEN)-1) << AW_PID_2113_VBAT_DET_START_BIT))

#define AW_PID_2113_VBAT_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2113_VBAT_DET_DEFAULT	\
	(AW_PID_2113_VBAT_DET_DEFAULT_VALUE << AW_PID_2113_VBAT_DET_START_BIT)

/* default value of VBAT (0x21) */
/* #define AW_PID_2113_VBAT_DEFAULT		(0x0263) */

/* TEMP (0x22) detail */
/* TEMP_DET bit 9:0 (TEMP 0x22) */
#define AW_PID_2113_TEMP_DET_START_BIT	(0)
#define AW_PID_2113_TEMP_DET_BITS_LEN	(10)
#define AW_PID_2113_TEMP_DET_MASK	\
	(~(((1<<AW_PID_2113_TEMP_DET_BITS_LEN)-1) << AW_PID_2113_TEMP_DET_START_BIT))

#define AW_PID_2113_TEMP_DET_MINUS_40	(0x3D8)
#define AW_PID_2113_TEMP_DET_MINUS_40__VALUE	\
	(AW_PID_2113_TEMP_DET_MINUS_40 << AW_PID_2113_TEMP_DET_START_BIT)

#define AW_PID_2113_TEMP_DET_0	(0x00)
#define AW_PID_2113_TEMP_DET_0__VALUE	\
	(AW_PID_2113_TEMP_DET_0 << AW_PID_2113_TEMP_DET_START_BIT)

#define AW_PID_2113_TEMP_DET_1	(0x01)
#define AW_PID_2113_TEMP_DET_1__VALUE	\
	(AW_PID_2113_TEMP_DET_1 << AW_PID_2113_TEMP_DET_START_BIT)

#define AW_PID_2113_TEMP_DET_25	(0x19)
#define AW_PID_2113_TEMP_DET_25__VALUE	\
	(AW_PID_2113_TEMP_DET_25 << AW_PID_2113_TEMP_DET_START_BIT)

#define AW_PID_2113_TEMP_DET_55	(0x37)
#define AW_PID_2113_TEMP_DET_55__VALUE	\
	(AW_PID_2113_TEMP_DET_55 << AW_PID_2113_TEMP_DET_START_BIT)

#define AW_PID_2113_TEMP_DET_DEFAULT_VALUE	(0x019)
#define AW_PID_2113_TEMP_DET_DEFAULT	\
	(AW_PID_2113_TEMP_DET_DEFAULT_VALUE << AW_PID_2113_TEMP_DET_START_BIT)

/* default value of TEMP (0x22) */
/* #define AW_PID_2113_TEMP_DEFAULT		(0x0019) */

/* PVDD (0x23) detail */
/* PVDD_DET bit 9:0 (PVDD 0x23) */
#define AW_PID_2113_PVDD_DET_START_BIT	(0)
#define AW_PID_2113_PVDD_DET_BITS_LEN	(10)
#define AW_PID_2113_PVDD_DET_MASK	\
	(~(((1<<AW_PID_2113_PVDD_DET_BITS_LEN)-1) << AW_PID_2113_PVDD_DET_START_BIT))

#define AW_PID_2113_PVDD_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2113_PVDD_DET_DEFAULT	\
	(AW_PID_2113_PVDD_DET_DEFAULT_VALUE << AW_PID_2113_PVDD_DET_START_BIT)

/* default value of PVDD (0x23) */
/* #define AW_PID_2113_PVDD_DEFAULT		(0x0263) */

/* BOP_EN bit 5 (SADCCTRL3 0x3C) */
#define AW_PID_2113_BOP_EN_START_BIT	(5)
#define AW_PID_2113_BOP_EN_BITS_LEN	(1)
#define AW_PID_2113_BOP_EN_MASK	\
	(~(((1<<AW_PID_2113_BOP_EN_BITS_LEN)-1) << AW_PID_2113_BOP_EN_START_BIT))

#define AW_PID_2113_BOP_EN_ENABLE	(1)
#define AW_PID_2113_BOP_EN_ENABLE_VALUE	\
	(AW_PID_2113_BOP_EN_ENABLE << AW_PID_2113_BOP_EN_START_BIT)

#define AW_PID_2113_BOP_EN_DISABLE	(0)
#define AW_PID_2113_BOP_EN_DISABLE_VALUE	\
	(AW_PID_2113_BOP_EN_DISABLE << AW_PID_2113_BOP_EN_START_BIT)

/* CCO_MUX bit 6 (PLLCTRL1 0x54) */
#define AW_PID_2113_CCO_MUX_START_BIT	(6)
#define AW_PID_2113_CCO_MUX_BITS_LEN	(1)
#define AW_PID_2113_CCO_MUX_MASK	\
	(~(((1<<AW_PID_2113_CCO_MUX_BITS_LEN)-1) << AW_PID_2113_CCO_MUX_START_BIT))

#define AW_PID_2113_CCO_MUX_DIVIDED	(0)
#define AW_PID_2113_CCO_MUX_DIVIDED_VALUE	\
		(AW_PID_2113_CCO_MUX_DIVIDED << AW_PID_2113_CCO_MUX_START_BIT)

#define AW_PID_2113_CCO_MUX_BYPASS	(1)
#define AW_PID_2113_CCO_MUX_BYPASS_VALUE	\
	(AW_PID_2113_CCO_MUX_BYPASS << AW_PID_2113_CCO_MUX_START_BIT)


/* BSTCTRL1 (0x60) detail */
/* BST_RTH bit 13:8 (BSTCTRL1 0x60) */
#define AW_PID_2113_BST_RTH_START_BIT	(8)
#define AW_PID_2113_BST_RTH_BITS_LEN	(6)
#define AW_PID_2113_BST_RTH_MASK	\
	(~(((1<<AW_PID_2113_BST_RTH_BITS_LEN)-1) << AW_PID_2113_BST_RTH_START_BIT))

#define AW_PID_2113_BST_RTH_DEFAULT_VALUE	(4)
#define AW_PID_2113_BST_RTH_DEFAULT	\
	(AW_PID_2113_BST_RTH_DEFAULT_VALUE << AW_PID_2113_BST_RTH_START_BIT)

/* BST_MODE bit 7:6 (BSTCTRL1 0x60) */
#define AW_PID_2113_BST_MODE_START_BIT	(6)
#define AW_PID_2113_BST_MODE_BITS_LEN	(2)
#define AW_PID_2113_BST_MODE_MASK	\
	(~(((1<<AW_PID_2113_BST_MODE_BITS_LEN)-1) << AW_PID_2113_BST_MODE_START_BIT))

#define AW_PID_2113_BST_MODE_TRANSPARENT	(0)
#define AW_PID_2113_BST_MODE_TRANSPARENT_VALUE	\
	(AW_PID_2113_BST_MODE_TRANSPARENT << AW_PID_2113_BST_MODE_START_BIT)

#define AW_PID_2113_BST_MODE_FORCE_BOOST	(1)
#define AW_PID_2113_BST_MODE_FORCE_BOOST_VALUE	\
	(AW_PID_2113_BST_MODE_FORCE_BOOST << AW_PID_2113_BST_MODE_START_BIT)

#define AW_PID_2113_BST_MODE_CLASS_G	(2)
#define AW_PID_2113_BST_MODE_CLASS_G_VALUE	\
	(AW_PID_2113_BST_MODE_CLASS_G << AW_PID_2113_BST_MODE_START_BIT)

#define AW_PID_2113_BST_MODE_CLASS_H	(3)
#define AW_PID_2113_BST_MODE_CLASS_H_VALUE	\
	(AW_PID_2113_BST_MODE_CLASS_H << AW_PID_2113_BST_MODE_START_BIT)

#define AW_PID_2113_BST_MODE_DEFAULT_VALUE	(0x3)
#define AW_PID_2113_BST_MODE_DEFAULT	\
	(AW_PID_2113_BST_MODE_DEFAULT_VALUE << AW_PID_2113_BST_MODE_START_BIT)

