LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
/* BST_ATH bit 5:0 (BSTCTRL1 0x60) */
#define AW_PID_2113_BST_ATH_START_BIT	(0)
#define AW_PID_2113_BST_ATH_BITS_LEN	(6)
#define AW_PID_2113_BST_ATH_MASK	\
	(~(((1<<AW_PID_2113_BST_ATH_BITS_LEN)-1) << AW_PID_2113_BST_ATH_START_BIT))

#define AW_PID_2113_BST_ATH_DEFAULT_VALUE	(2)
#define AW_PID_2113_BST_ATH_DEFAULT	\
	(AW_PID_2113_BST_ATH_DEFAULT_VALUE << AW_PID_2113_BST_ATH_START_BIT)

/* default value of BSTCTRL1 (0x60) */
/* #define AW_PID_2113_BSTCTRL1_DEFAULT		(0x04C2) */

/* BSTCTRL2 (0x61) detail */
/* BST_IPEAK bit 15:12 (BSTCTRL2 0x61) */
#define AW_PID_2113_BST_IPEAK_START_BIT	(12)
#define AW_PID_2113_BST_IPEAK_BITS_LEN	(4)
#define AW_PID_2113_BST_IPEAK_MASK	\
	(~(((1<<AW_PID_2113_BST_IPEAK_BITS_LEN)-1) << AW_PID_2113_BST_IPEAK_START_BIT))

#define AW_PID_2113_BST_IPEAK_1P5A	(0)
#define AW_PID_2113_BST_IPEAK_1P5A_VALUE	\
	(AW_PID_2113_BST_IPEAK_1P5A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_1P75A	(1)
#define AW_PID_2113_BST_IPEAK_1P75A_VALUE	\
	(AW_PID_2113_BST_IPEAK_1P75A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_2P0A	(2)
#define AW_PID_2113_BST_IPEAK_2P0A_VALUE	\
	(AW_PID_2113_BST_IPEAK_2P0A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_2P25A	(3)
#define AW_PID_2113_BST_IPEAK_2P25A_VALUE	\
	(AW_PID_2113_BST_IPEAK_2P25A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_2P5A	(4)
#define AW_PID_2113_BST_IPEAK_2P5A_VALUE	\
	(AW_PID_2113_BST_IPEAK_2P5A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_2P75A	(5)
#define AW_PID_2113_BST_IPEAK_2P75A_VALUE	\
	(AW_PID_2113_BST_IPEAK_2P75A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_3P0A	(6)
#define AW_PID_2113_BST_IPEAK_3P0A_VALUE	\
	(AW_PID_2113_BST_IPEAK_3P0A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_3P25A	(7)
#define AW_PID_2113_BST_IPEAK_3P25A_VALUE	\
	(AW_PID_2113_BST_IPEAK_3P25A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_3P5A	(8)
#define AW_PID_2113_BST_IPEAK_3P5A_VALUE	\
	(AW_PID_2113_BST_IPEAK_3P5A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_3P75A	(9)
#define AW_PID_2113_BST_IPEAK_3P75A_VALUE	\
	(AW_PID_2113_BST_IPEAK_3P75A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_4A	(10)
#define AW_PID_2113_BST_IPEAK_4A_VALUE	\
	(AW_PID_2113_BST_IPEAK_4A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_4P25A	(11)
#define AW_PID_2113_BST_IPEAK_4P25A_VALUE	\
	(AW_PID_2113_BST_IPEAK_4P25A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_4P50A	(12)
#define AW_PID_2113_BST_IPEAK_4P50A_VALUE	\
	(AW_PID_2113_BST_IPEAK_4P50A << AW_PID_2113_BST_IPEAK_START_BIT)

#define AW_PID_2113_BST_IPEAK_DEFAULT_VALUE	(9)
#define AW_PID_2113_BST_IPEAK_DEFAULT	\
	(AW_PID_2113_BST_IPEAK_DEFAULT_VALUE << AW_PID_2113_BST_IPEAK_START_BIT)

/* BST_TDEG bit 11:8 (BSTCTRL2 0x61) */
#define AW_PID_2113_BST_TDEG_START_BIT	(8)
#define AW_PID_2113_BST_TDEG_BITS_LEN	(4)
#define AW_PID_2113_BST_TDEG_MASK	\
	(~(((1<<AW_PID_2113_BST_TDEG_BITS_LEN)-1) << AW_PID_2113_BST_TDEG_START_BIT))

#define AW_PID_2113_BST_TDEG_0P50_MS	(0)
#define AW_PID_2113_BST_TDEG_0P50_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_0P50_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_1P00_MS	(1)
#define AW_PID_2113_BST_TDEG_1P00_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_1P00_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_2P00_MS	(2)
#define AW_PID_2113_BST_TDEG_2P00_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_2P00_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_4P00_MS	(3)
#define AW_PID_2113_BST_TDEG_4P00_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_4P00_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_8P00_MS	(4)
#define AW_PID_2113_BST_TDEG_8P00_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_8P00_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_10P7_MS	(5)
#define AW_PID_2113_BST_TDEG_10P7_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_10P7_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_13P3_MS	(6)
#define AW_PID_2113_BST_TDEG_13P3_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_13P3_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_16P0_MS	(7)
#define AW_PID_2113_BST_TDEG_16P0_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_16P0_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_18P6_MS	(8)
#define AW_PID_2113_BST_TDEG_18P6_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_18P6_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_21P3_MS	(9)
#define AW_PID_2113_BST_TDEG_21P3_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_21P3_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_24P0_MS	(10)
#define AW_PID_2113_BST_TDEG_24P0_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_24P0_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_32P0_MS	(11)
#define AW_PID_2113_BST_TDEG_32P0_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_32P0_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_64P0_MS	(12)
#define AW_PID_2113_BST_TDEG_64P0_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_64P0_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_128_MS	(13)
#define AW_PID_2113_BST_TDEG_128_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_128_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_256_MS	(14)
#define AW_PID_2113_BST_TDEG_256_MS_VALUE	\
	(AW_PID_2113_BST_TDEG_256_MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_1024MS	(15)
#define AW_PID_2113_BST_TDEG_1024MS_VALUE	\
	(AW_PID_2113_BST_TDEG_1024MS << AW_PID_2113_BST_TDEG_START_BIT)

#define AW_PID_2113_BST_TDEG_DEFAULT_VALUE	(11)
#define AW_PID_2113_BST_TDEG_DEFAULT	\
	(AW_PID_2113_BST_TDEG_DEFAULT_VALUE << AW_PID_2113_BST_TDEG_START_BIT)

/* VOUT_VREFSET bit 6:0 (BSTCTRL2 0x61) */
#define AW_PID_2113_VOUT_VREFSET_START_BIT	(0)
#define AW_PID_2113_VOUT_VREFSET_BITS_LEN	(7)
#define AW_PID_2113_VOUT_VREFSET_MASK	\
	(~(((1<<AW_PID_2113_VOUT_VREFSET_BITS_LEN)-1) << AW_PID_2113_VOUT_VREFSET_START_BIT))

#define AW_PID_2113_VOUT_VREFSET_3P5V	(0)
#define AW_PID_2113_VOUT_VREFSET_3P5V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_3P5V << AW_PID_2113_VOUT_VREFSET_START_BIT)

