LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88265/aw882xx_pid_2113_reg.h
#define AW_PID_2113_VOUT_VREFSET_3P5625V	(1)
#define AW_PID_2113_VOUT_VREFSET_3P5625V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_3P5625V << AW_PID_2113_VOUT_VREFSET_START_BIT)

#define AW_PID_2113_VOUT_VREFSET_3P625V	(2)
#define AW_PID_2113_VOUT_VREFSET_3P625V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_3P625V << AW_PID_2113_VOUT_VREFSET_START_BIT)

#define AW_PID_2113_VOUT_VREFSET_3P6875V	(3)
#define AW_PID_2113_VOUT_VREFSET_3P6875V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_3P6875V << AW_PID_2113_VOUT_VREFSET_START_BIT)

#define AW_PID_2113_VOUT_VREFSET_3P75V	(4)
#define AW_PID_2113_VOUT_VREFSET_3P75V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_3P75V << AW_PID_2113_VOUT_VREFSET_START_BIT)

#define AW_PID_2113_VOUT_VREFSET_3P8125V	(5)
#define AW_PID_2113_VOUT_VREFSET_3P8125V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_3P8125V << AW_PID_2113_VOUT_VREFSET_START_BIT)

#define AW_PID_2113_VOUT_VREFSET_11P4375V	(127)
#define AW_PID_2113_VOUT_VREFSET_11P4375V_VALUE	\
	(AW_PID_2113_VOUT_VREFSET_11P4375V << AW_PID_2113_VOUT_VREFSET_START_BIT)

#define AW_PID_2113_VOUT_VREFSET_DEFAULT_VALUE	(0x58)
#define AW_PID_2113_VOUT_VREFSET_DEFAULT	\
	(AW_PID_2113_VOUT_VREFSET_DEFAULT_VALUE << AW_PID_2113_VOUT_VREFSET_START_BIT)

/* default value of BSTCTRL2 (0x61) */
/* #define AW_PID_2113_BSTCTRL2_DEFAULT		(0x9B58) */

/* FORCE_PWM bit 12 (BSTCTRL3 0x62) */
#define AW_PID_2113_FORCE_PWM_START_BIT	(12)
#define AW_PID_2113_FORCE_PWM_BITS_LEN	(1)
#define AW_PID_2113_FORCE_PWM_MASK	\
	(~(((1<<AW_PID_2113_FORCE_PWM_BITS_LEN)-1) << AW_PID_2113_FORCE_PWM_START_BIT))

#define AW_PID_2113_FORCE_PWM_FORCEMINUS_PWM	(1)
#define AW_PID_2113_FORCE_PWM_FORCEMINUS_PWM_VALUE	\
	(AW_PID_2113_FORCE_PWM_FORCEMINUS_PWM << AW_PID_2113_FORCE_PWM_START_BIT)

/* BST_OS_WIDTH bit 2:0 (BSTCTRL5 0x64) */
#define AW_PID_2113_BST_OS_WIDTH_START_BIT	(0)
#define AW_PID_2113_BST_OS_WIDTH_BITS_LEN	(3)
#define AW_PID_2113_BST_OS_WIDTH_MASK	\
	(~(((1<<AW_PID_2113_BST_OS_WIDTH_BITS_LEN)-1) << AW_PID_2113_BST_OS_WIDTH_START_BIT))


#define AW_PID_2113_BST_OS_WIDTH_50NS	(4)
#define AW_PID_2113_BST_OS_WIDTH_50NS_VALUE	\
	(AW_PID_2113_BST_OS_WIDTH_50NS << AW_PID_2113_BST_OS_WIDTH_START_BIT)

/* BST_LOOPR bit 1:0 (BSTCTRL6 0x65) */
#define AW_PID_2113_BST_LOOPR_START_BIT	(0)
#define AW_PID_2113_BST_LOOPR_BITS_LEN	(2)
#define AW_PID_2113_BST_LOOPR_MASK	\
	(~(((1<<AW_PID_2113_BST_LOOPR_BITS_LEN)-1) << AW_PID_2113_BST_LOOPR_START_BIT))

#define AW_PID_2113_BST_LOOPR_340K	(2)
#define AW_PID_2113_BST_LOOPR_340K_VALUE	\
	(AW_PID_2113_BST_LOOPR_340K << AW_PID_2113_BST_LOOPR_START_BIT)

/* RSQN_DLY bit 15:14 (BSTCTRL7 0x66) */
#define AW_PID_2113_RSQN_DLY_START_BIT	(14)
#define AW_PID_2113_RSQN_DLY_BITS_LEN	(2)
#define AW_PID_2113_RSQN_DLY_MASK	\
	(~(((1<<AW_PID_2113_RSQN_DLY_BITS_LEN)-1) << AW_PID_2113_RSQN_DLY_START_BIT))

#define AW_PID_2113_RSQN_DLY_35NS	(2)
#define AW_PID_2113_RSQN_DLY_35NS_VALUE	\
	(AW_PID_2113_RSQN_DLY_35NS << AW_PID_2113_RSQN_DLY_START_BIT)

/* BURST_SSMODE bit 3 (BSTCTRL8 0x67) */
#define AW_PID_2113_BURST_SSMODE_START_BIT	(3)
#define AW_PID_2113_BURST_SSMODE_BITS_LEN	(1)
#define AW_PID_2113_BURST_SSMODE_MASK	\
	(~(((1<<AW_PID_2113_BURST_SSMODE_BITS_LEN)-1) << AW_PID_2113_BURST_SSMODE_START_BIT))

#define AW_PID_2113_BURST_SSMODE_FAST	(0)
#define AW_PID_2113_BURST_SSMODE_FAST_VALUE	\
	(AW_PID_2113_BURST_SSMODE_FAST << AW_PID_2113_BURST_SSMODE_START_BIT)

/* BST_BURST bit 9:7 (BSTCTRL9 0x68) */
#define AW_PID_2113_BST_BURST_START_BIT	(7)
#define AW_PID_2113_BST_BURST_BITS_LEN	(3)
#define AW_PID_2113_BST_BURST_MASK	\
	(~(((1<<AW_PID_2113_BST_BURST_BITS_LEN)-1) << AW_PID_2113_BST_BURST_START_BIT))

#define AW_PID_2113_BST_BURST_30MA	(2)
#define AW_PID_2113_BST_BURST_30MA_VALUE	\
	(AW_PID_2113_BST_BURST_30MA << AW_PID_2113_BST_BURST_START_BIT)

/* EF_ISN_GESLP_H bit 9:0 (EFRH4 0x78) */
#define AW_PID_2113_EF_ISN_GESLP_H_START_BIT	(0)
#define AW_PID_2113_EF_ISN_GESLP_H_BITS_LEN	(10)
#define AW_PID_2113_EF_ISN_GESLP_H_MASK	\
	(~(((1<<AW_PID_2113_EF_ISN_GESLP_H_BITS_LEN)-1) << AW_PID_2113_EF_ISN_GESLP_H_START_BIT))

/* EF_VSN_GESLP_H bit 9:0 (EFRH3 0x79) */
#define AW_PID_2113_EF_VSN_GESLP_H_START_BIT	(0)
#define AW_PID_2113_EF_VSN_GESLP_H_BITS_LEN	(10)
#define AW_PID_2113_EF_VSN_GESLP_H_MASK	\
	(~(((1<<AW_PID_2113_EF_VSN_GESLP_H_BITS_LEN)-1) << AW_PID_2113_EF_VSN_GESLP_H_START_BIT))

/* EF_ISN_GESLP_L bit 9:0 (EFRL4 0x7C) */
#define AW_PID_2113_EF_ISN_GESLP_L_START_BIT	(0)
#define AW_PID_2113_EF_ISN_GESLP_L_BITS_LEN	(10)
#define AW_PID_2113_EF_ISN_GESLP_L_MASK	\
	(~(((1<<AW_PID_2113_EF_ISN_GESLP_L_BITS_LEN)-1) << AW_PID_2113_EF_ISN_GESLP_L_START_BIT))

/* EF_VSN_GESLP_L bit 9:0 (EFRL3 0x7D) */
#define AW_PID_2113_EF_VSN_GESLP_L_START_BIT	(0)
#define AW_PID_2113_EF_VSN_GESLP_L_BITS_LEN	(10)
#define AW_PID_2113_EF_VSN_GESLP_L_MASK	\
	(~(((1<<AW_PID_2113_EF_VSN_GESLP_L_BITS_LEN)-1) << AW_PID_2113_EF_VSN_GESLP_L_START_BIT))


/* detail information of registers end */
/********************************************
 * Efdbmd
 *******************************************/
#define AW_PID_2113_EF_DBMD_MASK		(0xfff7)
#define AW_PID_2113_AND_VALUE			(0x0000)
#define AW_PID_2113_OR_VALUE			(0x0008)

/********************************************
 * Volume Coefficient
 *******************************************/
#define AW_PID_2113_VOL_STEP		(6 * 8)
/********************************************
 * Vcalb
 *******************************************/
#define AW_PID_2113_EF_VSN_GESLP_SIGN_MASK	(~0x0200)
#define AW_PID_2113_EF_VSN_GESLP_NEG		(~0xfc00)

#define AW_PID_2113_EF_ISN_GESLP_SIGN_MASK	(~0x0200)
#define AW_PID_2113_EF_ISN_GESLP_NEG		(~0xfc00)

#define AW_PID_2113_CABL_BASE_VALUE		(1000)
#define AW_PID_2113_ICABLK_FACTOR		(1)
#define AW_PID_2113_VCABLK_FACTOR		(1)

#define AW_PID_2113_VCAL_FACTOR			(1<<13)

#define AW_PID_2113_ICALK_SHIFT			(0)
#define AW_PID_2113_ICALKL_SHIFT		(0)
#define AW_PID_2113_VCALK_SHIFT			(0)
#define AW_PID_2113_VCALKL_SHIFT		(0)

#define AW_PID_2113_MONITOR_VBAT_RANGE		(6025)
#define AW_PID_2113_MONITOR_INT_10BIT		(1023)
#define AW_PID_2113_MONITOR_TEMP_SIGN_MASK	(~(1<<9))
#define AW_PID_2113_MONITOR_TEMP_NEG_MASK	(0xFC00)

#define AW_PID_2113_TEMH_MASK			(0x83ff)
#define AW_PID_2113_TEML_MASK			(0x83ff)
#define AW_PID_2113_DEFAULT_CFG			(0x0000)

/********************************************
 * Init check
 *******************************************/
#define AW_PID_2113_INIT_CHECK_REG		(0x73)
#define AW_PID_2113_INIT_CHECK_VALUE		(0x1D40)

/********************************************
 * Dither
 *******************************************/
#define AW_PID_2113_DITHER_START_BIT	(14)
#define AW_PID_2113_DITHER_BITS_LEN	(1)
#define AW_PID_2113_DITHER_MASK	\
	(~(((1<<AW_PID_2113_DITHER_BITS_LEN)-1) << AW_PID_2113_DITHER_START_BIT))

#define AW_PID_2113_DITHER_DISABLE	(0)
#define AW_PID_2113_DITHER_DISABLE_VALUE	\
	(AW_PID_2113_DITHER_DISABLE << AW_PID_2113_DITHER_START_BIT)

#define AW_PID_2113_DITHER_ENABLE	(1)
#define AW_PID_2113_DITHER_ENABLE_VALUE	\
	(AW_PID_2113_DITHER_ENABLE << AW_PID_2113_DITHER_START_BIT)

#endif  /* #ifndef  __AW_PID_2113_REG_H__ */
